{
    "filename": "7432-multivariate-time-series-imputation-with-generative-adversarial-networks.pdf",
    "metadata": {
        "title": "Multivariate Time Series Imputation with Generative Adversarial Networks",
        "author": "Yonghong Luo, Xiangrui Cai, Ying ZHANG, Jun Xu, Yuan xiaojie",
        "date": 2018,
        "identifiers": {
            "url": "https://papers.nips.cc/paper/7432-multivariate-time-series-imputation-with-generative-adversarial-networks.pdf"
        },
        "journal": "Conference on Neural Information Processing Systems",
        "abstract": "Multivariate time series usually contain a large number of missing values, which hinders the application of advanced analysis methods on multivariate time series data. Conventional approaches to addressing the challenge of missing values, including mean/zero imputation, case deletion, and matrix factorization-based imputation, are all incapable of modeling the temporal dependencies and the nature of complex distribution in multivariate time series. In this paper, we treat the problem of missing value imputation as data generation. Inspired by the success of Generative Adversarial Networks (GAN) in image generation, we propose to learn the overall distribution of a multivariate time series dataset with GAN, which is further used to generate the missing values for each sample. Different from the image data, the time series data are usually incomplete due to the nature of data recording process. A modified Gate Recurrent Unit is employed in GAN to model the temporal irregularity of the incomplete time series. Experiments on two multivariate time series datasets show that the proposed model outperformed the baselines in terms of accuracy of imputation. Experimental results also showed that a simple model on the imputed data can achieve state-of-the-art results on the prediction tasks, demonstrating the benefits of our model in downstream applications."
    },
    "keywords": [
        {
            "term": "real world",
            "url": "https://en.wikipedia.org/wiki/real_world"
        },
        {
            "term": "mean squared errors",
            "url": "https://en.wikipedia.org/wiki/Mean_Squared_Error"
        },
        {
            "term": "generative adversarial network",
            "url": "https://en.wikipedia.org/wiki/generative_adversarial_network"
        },
        {
            "term": "intensive care unit",
            "url": "https://en.wikipedia.org/wiki/intensive_care_unit"
        },
        {
            "term": "multivariate time series",
            "url": "https://en.wikipedia.org/wiki/multivariate_time_series"
        },
        {
            "term": "Neural Network",
            "url": "https://en.wikipedia.org/wiki/Neural_Network"
        }
    ],
    "highlights": [
        "The real world is filled with multivariate time series data such as network records, medical logs and meteorologic observations",
        "In order to learn the latent relationships between observations with non-fixed time lags, we propose a novel RNN cell called GRUI which can take into account the non-fixed time lags and fade the influence of the past observations determined by the time lags",
        "To appropriate learn the distribution and characteristic of the original incomplete time series dataset, we find that, the time lag between two consecutive valid observations is always in changing because of the “none” values",
        "The RNN classifier is composed by a GRUI layer that processes complete time series and a full-connection layer that outputs classification results",
        "It is worth noting that, we achieve the new state-of-the-art mortality prediction result with AUC score of 0.8603 by using the dataset imputed by the generative adversarial networks based imputation method, while the previous state-of-the-art AUC score is 0.848 [<a class=\"ref-link\" id=\"c25\" href=\"#r25\">25</a>]",
        "Experimental results show that our method can outperform the baselines in terms of accuracy of missing value imputation, and has benefits for downstream applications"
    ],
    "key_statements": [
        "The real world is filled with multivariate time series data such as network records, medical logs and meteorologic observations",
        "In order to learn the latent relationships between observations with non-fixed time lags, we propose a novel RNN cell called GRUI which can take into account the non-fixed time lags and fade the influence of the past observations determined by the time lags",
        "By adopting the GRUI in the discriminator and generator in generative adversarial networks, the well trained adversarial model can learn the distribution of the whole dataset, the implicit relationships between observations and the temporal information of the dataset",
        "In order to replace missing values in time series data with reasonable values, we first train a generative adversarial networks based model to learn the distribution of the original time series dataset",
        "In order to effectively handle the irregular time lags and to learn the implicit information from the time intervals, we propose the GRUI cell based on Gated Recurrent Unit",
        "To appropriate learn the distribution and characteristic of the original incomplete time series dataset, we find that, the time lag between two consecutive valid observations is always in changing because of the “none” values",
        "In order to fit this decayed influence of the past observations, we propose the Gated Recurrent Unit for data Imputation (GRUI) cell to model the temporal irregularity of the incomplete time series",
        "If we conduct standardization on zero value imputation, the zero value imputation will be same as the mean imputation",
        "The RNN classifier is composed by a GRUI layer that processes complete time series and a full-connection layer that outputs classification results",
        "Except for the SVM classifier with RBF kernel, the classifiers trained on dataset imputed by proposed method always gain the best AUC score. These results can prove the success of generative adversarial networks based imputation method indirectly because of the lack of complete dataset",
        "It is worth noting that, we achieve the new state-of-the-art mortality prediction result with AUC score of 0.8603 by using the dataset imputed by the generative adversarial networks based imputation method, while the previous state-of-the-art AUC score is 0.848 [<a class=\"ref-link\" id=\"c25\" href=\"#r25\">25</a>]",
        "Figure 7 shows that the regression model trained with dataset which is imputed by the proposed method always gains the minimum mean squared errors value",
        "We propose a novel generative adversarial networks for data imputation",
        "The temporal relationships, the inner-class similarities, and the distribution of the dataset can be automatically learned under the adversarial architecture",
        "Experimental results show that our method can outperform the baselines in terms of accuracy of missing value imputation, and has benefits for downstream applications"
    ],
    "summary": [
        "The real world is filled with multivariate time series data such as network records, medical logs and meteorologic observations.",
        "By adopting the GRUI in the discriminator and generator in GAN, the well trained adversarial model can learn the distribution of the whole dataset, the implicit relationships between observations and the temporal information of the dataset.",
        "In order to replace missing values in time series data with reasonable values, we first train a GAN based model to learn the distribution of the original time series dataset.",
        "In order to fit this decayed influence of the past observations, we propose the Gated Recurrent Unit for data Imputation (GRUI) cell to model the temporal irregularity of the incomplete time series.",
        "From the GAN architecture, we can know that, the generator G can learn a mapping G(z) = z → x that maps the random noise vector z to a complete time series which contains no missing value.",
        "Just like what we did previously, we use the air quality prediction results calculated by the same regression model but trained on different imputed datasets to determine the performance of imputation methods.",
        "1) Classification task: we use different datasets imputed by proposed method and some other methods to train logistic regression classifier, SVM classifier, random forest classifier and RNN classifier.",
        "The standardization of input dataset is conducted when we impute the missing values with mean value, last value and GAN generated value.",
        "We train the logistic regression classifier, SVM classifiers, random forest classifier and RNN classifier on these above imputed complete datasets to indirectly compare the filling accuracy of these filling methods.",
        "These results can prove the success of GAN based imputation method indirectly because of the lack of complete dataset.",
        "Figure 7 shows that the regression model trained with dataset which is imputed by the proposed method always gains the minimum MSE value.",
        "The reason is that our model can learn and make use of the flexible time lags of the dataset and produces better results than a non-modified GRU cell.",
        "This part will introduce the related works about missing value processing methods and generative adversarial networks.",
        "Neural Network based imputation [<a class=\"ref-link\" id=\"c16\" href=\"#r16\">16</a>] uses the numerous parameters of the neural network to learn the distribution of train dataset and fills the missing values.",
        "In order to learn the unfixed time lags of two observed values, a modified GRU cell is proposed for processing the incomplete time series.",
        "After the training of the GAN model with GRUI cell, the “noise” input vector of the generator is trained and generating reasonable values for imputation.",
        "Experimental results show that our method can outperform the baselines in terms of accuracy of missing value imputation, and has benefits for downstream applications"
    ],
    "headline": "Inspired by the success of Generative Adversarial Networks  in image generation, we propose to learn the overall distribution of a multivariate time series dataset with generative adversarial networks, which is further used to generate the missing values for each sample",
    "reference_links": [
        {
            "id": "1",
            "entry": "[1] Edgar Acuna and Caroline Rodriguez. The treatment of missing values and its effect on classifier accuracy. In Classification, clustering, and data mining applications, pages 639–647.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Acuna%2C%20Edgar%20Rodriguez%2C%20Caroline%20The%20treatment%20of%20missing%20values%20and%20its%20effect%20on%20classifier%20accuracy.%20In%20Classification%2C%20clustering%2C%20and%20data%20mining%20applications"
        },
        {
            "id": "2",
            "entry": "[2] Mehran Amiri and Richard Jensen. Missing data imputation using fuzzy-rough methods. Neurocomputing, 205:152–164, 2016.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Amiri%2C%20Mehran%20Jensen%2C%20Richard%20Missing%20data%20imputation%20using%20fuzzy-rough%20methods%202016",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Amiri%2C%20Mehran%20Jensen%2C%20Richard%20Missing%20data%20imputation%20using%20fuzzy-rough%20methods%202016"
        },
        {
            "id": "3",
            "entry": "[3] Martin Arjovsky, Soumith Chintala, and Léon Bottou. Wasserstein generative adversarial networks. In International Conference on Machine Learning, pages 214–223, 2017.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Martin%20Arjovsky%2C%20Soumith%20Chintala%20Bottou%2C%20L%C3%A9on%20Wasserstein%20generative%20adversarial%20networks%202017",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Martin%20Arjovsky%2C%20Soumith%20Chintala%20Bottou%2C%20L%C3%A9on%20Wasserstein%20generative%20adversarial%20networks%202017"
        },
        {
            "id": "4",
            "entry": "[4] Gustavo EAPA Batista and Maria Carolina Monard. An analysis of four missing data treatment methods for supervised learning. Applied artificial intelligence, 17(5-6):519–533, 2003.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Batista%2C%20Gustavo%20E.A.P.A.%20Monard%2C%20Maria%20Carolina%20An%20analysis%20of%20four%20missing%20data%20treatment%20methods%20for%20supervised%20learning%202003",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Batista%2C%20Gustavo%20E.A.P.A.%20Monard%2C%20Maria%20Carolina%20An%20analysis%20of%20four%20missing%20data%20treatment%20methods%20for%20supervised%20learning%202003"
        },
        {
            "id": "5",
            "entry": "[5] Ashish Bora, Eric Price, and Alexandros G Dimakis. Ambientgan: Generative models from lossy measurements. In International Conference on Learning Representations (ICLR), 2018.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Bora%2C%20Ashish%20Price%2C%20Eric%20Dimakis%2C%20Alexandros%20G.%20Ambientgan%3A%20Generative%20models%20from%20lossy%20measurements%202018",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Bora%2C%20Ashish%20Price%2C%20Eric%20Dimakis%2C%20Alexandros%20G.%20Ambientgan%3A%20Generative%20models%20from%20lossy%20measurements%202018"
        },
        {
            "id": "6",
            "entry": "[6] Tong Che, Yanran Li, Ruixiang Zhang, R Devon Hjelm, Wenjie Li, Yangqiu Song, and Yoshua Bengio. Maximum-likelihood augmented discrete generative adversarial networks. arXiv preprint arXiv:1702.07983, 2017.",
            "arxiv_url": "https://arxiv.org/pdf/1702.07983"
        },
        {
            "id": "7",
            "entry": "[7] Zhengping Che, Sanjay Purushotham, Kyunghyun Cho, David Sontag, and Yan Liu. Recurrent neural networks for multivariate time series with missing values. Scientific reports, 8(1):6085, 2018.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Che%2C%20Zhengping%20Purushotham%2C%20Sanjay%20Cho%2C%20Kyunghyun%20Sontag%2C%20David%20Recurrent%20neural%20networks%20for%20multivariate%20time%20series%20with%20missing%20values%202018",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Che%2C%20Zhengping%20Purushotham%2C%20Sanjay%20Cho%2C%20Kyunghyun%20Sontag%2C%20David%20Recurrent%20neural%20networks%20for%20multivariate%20time%20series%20with%20missing%20values%202018"
        },
        {
            "id": "8",
            "entry": "[8] Jehanzeb R Cheema. A review of missing data handling methods in education research. Review of Educational Research, 84(4):487–508, 2014.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Cheema%2C%20Jehanzeb%20R.%20A%20review%20of%20missing%20data%20handling%20methods%20in%20education%20research%202014",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Cheema%2C%20Jehanzeb%20R.%20A%20review%20of%20missing%20data%20handling%20methods%20in%20education%20research%202014"
        },
        {
            "id": "9",
            "entry": "[9] Xi Chen, Yan Duan, Rein Houthooft, John Schulman, Ilya Sutskever, and Pieter Abbeel. Infogan: Interpretable representation learning by information maximizing generative adversarial nets. In Advances in Neural Information Processing Systems, pages 2172–2180, 2016.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Chen%2C%20Xi%20Duan%2C%20Yan%20Houthooft%2C%20Rein%20Schulman%2C%20John%20Infogan%3A%20Interpretable%20representation%20learning%20by%20information%20maximizing%20generative%20adversarial%20nets%202016",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Chen%2C%20Xi%20Duan%2C%20Yan%20Houthooft%2C%20Rein%20Schulman%2C%20John%20Infogan%3A%20Interpretable%20representation%20learning%20by%20information%20maximizing%20generative%20adversarial%20nets%202016"
        },
        {
            "id": "10",
            "entry": "[10] Kyunghyun Cho, Bart Van Merriënboer, Caglar Gulcehre, Dzmitry Bahdanau, Fethi Bougares, Holger Schwenk, and Yoshua Bengio. Learning phrase representations using rnn encoderdecoder for statistical machine translation. arXiv preprint arXiv:1406.1078, 2014.",
            "arxiv_url": "https://arxiv.org/pdf/1406.1078"
        },
        {
            "id": "11",
            "entry": "[11] KDD Cup. Available on: http://www.kdd.org/kdd2018/, 2018.",
            "url": "http://www.kdd.org/kdd2018/"
        },
        {
            "id": "12",
            "entry": "[12] A Rogier T Donders, Geert JMG Van Der Heijden, Theo Stijnen, and Karel GM Moons. A gentle introduction to imputation of missing values. Journal of clinical epidemiology, 59(10):1087– 1091, 2006.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Donders%2C%20A.Rogier%20T.%20Heijden%2C%20Geert%20J.M.G.Van%20Der%20Stijnen%2C%20Theo%20Moons%2C%20Karel%20G.M.%20A%20gentle%20introduction%20to%20imputation%20of%20missing%20values%202006",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Donders%2C%20A.Rogier%20T.%20Heijden%2C%20Geert%20J.M.G.Van%20Der%20Stijnen%2C%20Theo%20Moons%2C%20Karel%20G.M.%20A%20gentle%20introduction%20to%20imputation%20of%20missing%20values%202006"
        },
        {
            "id": "13",
            "entry": "[13] William Fedus, Ian Goodfellow, and Andrew M Dai. Maskgan: Better text generation via filling in the _. arXiv preprint arXiv:1801.07736, 2018.",
            "arxiv_url": "https://arxiv.org/pdf/1801.07736"
        },
        {
            "id": "14",
            "entry": "[14] Pedro J García-Laencina, Pedro Henriques Abreu, Miguel Henriques Abreu, and Noémia Afonoso. Missing data imputation on the 5-year survival prediction of breast cancer patients with unknown discrete values. Computers in biology and medicine, 59:125–133, 2015.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Garc%C3%ADa-Laencina%2C%20Pedro%20J.%20Abreu%2C%20Pedro%20Henriques%20Abreu%2C%20Miguel%20Henriques%20Afonoso%2C%20No%C3%A9mia%20Missing%20data%20imputation%20on%20the%205-year%20survival%20prediction%20of%20breast%20cancer%20patients%20with%20unknown%20discrete%20values%202015",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Garc%C3%ADa-Laencina%2C%20Pedro%20J.%20Abreu%2C%20Pedro%20Henriques%20Abreu%2C%20Miguel%20Henriques%20Afonoso%2C%20No%C3%A9mia%20Missing%20data%20imputation%20on%20the%205-year%20survival%20prediction%20of%20breast%20cancer%20patients%20with%20unknown%20discrete%20values%202015"
        },
        {
            "id": "15",
            "entry": "[15] Pedro J García-Laencina, José-Luis Sancho-Gómez, and Aníbal R Figueiras-Vidal. Pattern classification with missing data: a review. Neural Computing and Applications, 19(2):263–282, 2010.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Garc%C3%ADa-Laencina%2C%20Pedro%20J.%20Sancho-G%C3%B3mez%2C%20Jos%C3%A9-Luis%20Figueiras-Vidal%2C%20An%C3%ADbal%20R.%20Pattern%20classification%20with%20missing%20data%3A%20a%20review%202010",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Garc%C3%ADa-Laencina%2C%20Pedro%20J.%20Sancho-G%C3%B3mez%2C%20Jos%C3%A9-Luis%20Figueiras-Vidal%2C%20An%C3%ADbal%20R.%20Pattern%20classification%20with%20missing%20data%3A%20a%20review%202010"
        },
        {
            "id": "16",
            "entry": "[16] Iffat A Gheyas and Leslie S Smith. A neural network-based framework for the reconstruction of incomplete data sets. Neurocomputing, 73(16-18):3039–3065, 2010.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=-%20Iffat%20A%20Gheyas%20and%20Leslie%20S%20Smith.%20A%20neural%20network-based%20framework%20for%20the%20reconstruction%20of%20incomplete%20data%20sets%202010",
            "oa_query": "https://api.scholarcy.com/oa_version?query=-%20Iffat%20A%20Gheyas%20and%20Leslie%20S%20Smith.%20A%20neural%20network-based%20framework%20for%20the%20reconstruction%20of%20incomplete%20data%20sets%202010"
        },
        {
            "id": "17",
            "entry": "[17] Ian Goodfellow, Jean Pouget-Abadie, Mehdi Mirza, Bing Xu, David Warde-Farley, Sherjil Ozair, Aaron Courville, and Yoshua Bengio. Generative adversarial nets. In Advances in neural information processing systems, pages 2672–2680, 2014.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Goodfellow%2C%20Ian%20Pouget-Abadie%2C%20Jean%20Mirza%2C%20Mehdi%20Xu%2C%20Bing%20Generative%20adversarial%20nets%202014",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Goodfellow%2C%20Ian%20Pouget-Abadie%2C%20Jean%20Mirza%2C%20Mehdi%20Xu%2C%20Bing%20Generative%20adversarial%20nets%202014"
        },
        {
            "id": "18",
            "entry": "[18] John W Graham. Missing data analysis: Making it work in the real world. Annual review of psychology, 60:549–576, 2009.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Graham%2C%20John%20W.%20Missing%20data%20analysis%3A%20Making%20it%20work%20in%20the%20real%20world%202009",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Graham%2C%20John%20W.%20Missing%20data%20analysis%3A%20Making%20it%20work%20in%20the%20real%20world%202009"
        },
        {
            "id": "19",
            "entry": "[19] Trevor Hastie, Rahul Mazumder, Jason D Lee, and Reza Zadeh. Matrix completion and low-rank svd via fast alternating least squares. Journal of Machine Learning Research, 16:3367–3402, 2015.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Hastie%2C%20Trevor%20Mazumder%2C%20Rahul%20Lee%2C%20Jason%20D.%20Zadeh%2C%20Reza%20Matrix%20completion%20and%20low-rank%20svd%20via%20fast%20alternating%20least%20squares%202015",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Hastie%2C%20Trevor%20Mazumder%2C%20Rahul%20Lee%2C%20Jason%20D.%20Zadeh%2C%20Reza%20Matrix%20completion%20and%20low-rank%20svd%20via%20fast%20alternating%20least%20squares%202015"
        },
        {
            "id": "20",
            "entry": "[20] Martin Heusel, Hubert Ramsauer, Thomas Unterthiner, Bernhard Nessler, Günter Klambauer, and Sepp Hochreiter. Gans trained by a two time-scale update rule converge to a nash equilibrium. arXiv preprint arXiv:1706.08500, 2017.",
            "arxiv_url": "https://arxiv.org/pdf/1706.08500"
        },
        {
            "id": "21",
            "entry": "[21] Sepp Hochreiter and Jürgen Schmidhuber. Long short-term memory. Neural computation, 9(8):1735–1780, 1997.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Hochreiter%2C%20Sepp%20Schmidhuber%2C%20J%C3%BCrgen%20Long%20short-term%20memory%201997",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Hochreiter%2C%20Sepp%20Schmidhuber%2C%20J%C3%BCrgen%20Long%20short-term%20memory%201997"
        },
        {
            "id": "22",
            "entry": "[22] Tsung Jung Hsieh, Hsiao Fen Hsiao, and Wei Chang Yeh. Forecasting stock markets using wavelet transforms and recurrent neural networks: An integrated system based on artificial bee colony algorithm. Applied Soft Computing Journal, 11(2):2510–2525, 2011.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Hsieh%2C%20Tsung%20Jung%20Hsiao%2C%20Hsiao%20Fen%20Yeh%2C%20Wei%20Chang%20Forecasting%20stock%20markets%20using%20wavelet%20transforms%20and%20recurrent%20neural%20networks%3A%20An%20integrated%20system%20based%20on%20artificial%20bee%20colony%20algorithm%202011",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Hsieh%2C%20Tsung%20Jung%20Hsiao%2C%20Hsiao%20Fen%20Yeh%2C%20Wei%20Chang%20Forecasting%20stock%20markets%20using%20wavelet%20transforms%20and%20recurrent%20neural%20networks%3A%20An%20integrated%20system%20based%20on%20artificial%20bee%20colony%20algorithm%202011"
        },
        {
            "id": "23",
            "entry": "[23] Xun Huang, Yixuan Li, Omid Poursaeed, John Hopcroft, and Serge Belongie. Stacked generative adversarial networks. In IEEE Conference on Computer Vision and Pattern Recognition (CVPR), volume 2, page 4, 2017.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Huang%2C%20Xun%20Li%2C%20Yixuan%20Poursaeed%2C%20Omid%20Hopcroft%2C%20John%20Stacked%20generative%20adversarial%20networks%202017",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Huang%2C%20Xun%20Li%2C%20Yixuan%20Poursaeed%2C%20Omid%20Hopcroft%2C%20John%20Stacked%20generative%20adversarial%20networks%202017"
        },
        {
            "id": "24",
            "entry": "[24] Sergey Ioffe and Christian Szegedy. Batch normalization: Accelerating deep network training by reducing internal covariate shift. arXiv preprint arXiv:1502.03167, 2015.",
            "arxiv_url": "https://arxiv.org/pdf/1502.03167"
        },
        {
            "id": "25",
            "entry": "[25] Alistair EW Johnson, Andrew A Kramer, and Gari D Clifford. Data preprocessing and mortality prediction: The physionet/cinc 2012 challenge revisited. In Computing in Cardiology Conference (CinC), 2014, pages 157–160. IEEE, 2014.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Alistair%20EW%20Johnson%20Andrew%20A%20Kramer%20and%20Gari%20D%20Clifford%20Data%20preprocessing%20and%20mortality%20prediction%20The%20physionetcinc%202012%20challenge%20revisited%20In%20Computing%20in%20Cardiology%20Conference%20CinC%202014%20pages%20157160%20IEEE%202014",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Alistair%20EW%20Johnson%20Andrew%20A%20Kramer%20and%20Gari%20D%20Clifford%20Data%20preprocessing%20and%20mortality%20prediction%20The%20physionetcinc%202012%20challenge%20revisited%20In%20Computing%20in%20Cardiology%20Conference%20CinC%202014%20pages%20157160%20IEEE%202014"
        },
        {
            "id": "26",
            "entry": "[26] Jiri Kaiser. Dealing with missing values in data. Journal of systems integration, 5(1):42, 2014.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Kaiser%2C%20Jiri%20Dealing%20with%20missing%20values%20in%20data%202014",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Kaiser%2C%20Jiri%20Dealing%20with%20missing%20values%20in%20data%202014"
        },
        {
            "id": "27",
            "entry": "[27] Mehmed Kantardzic. Data mining: concepts, models, methods, and algorithms. John Wiley & Sons, 2011.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Kantardzic%2C%20Mehmed%20Data%20mining%3A%20concepts%2C%20models%2C%20methods%2C%20and%20algorithms%202011"
        },
        {
            "id": "28",
            "entry": "[28] Christian Ledig, Lucas Theis, Ferenc Huszár, Jose Caballero, Andrew Cunningham, Alejandro Acosta, Andrew Aitken, Alykhan Tejani, Johannes Totz, Zehan Wang, et al. Photo-realistic single image super-resolution using a generative adversarial network. arXiv preprint, 2016.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Ledig%2C%20Christian%20Theis%2C%20Lucas%20Husz%C3%A1r%2C%20Ferenc%20Caballero%2C%20Jose%20Photo-realistic%20single%20image%20super-resolution%20using%20a%20generative%20adversarial%20network.%20arXiv%20p%202016"
        },
        {
            "id": "29",
            "entry": "[29] Dae Hyun Lee and Eric Horvitz. Predicting mortality of intensive care patients via learning about hazard. In AAAI, pages 4953–4954, 2017.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=-%20Dae%20Hyun%20Lee%20and%20Eric%20Horvitz.%20Predicting%20mortality%20of%20intensive%20care%20patients%20via%20learning%20about%20hazard%202017",
            "oa_query": "https://api.scholarcy.com/oa_version?query=-%20Dae%20Hyun%20Lee%20and%20Eric%20Horvitz.%20Predicting%20mortality%20of%20intensive%20care%20patients%20via%20learning%20about%20hazard%202017"
        },
        {
            "id": "30",
            "entry": "[30] Yijun Li, Sifei Liu, Jimei Yang, and Ming-Hsuan Yang. Generative face completion. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, volume 1, page 6, 2017.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Li%2C%20Yijun%20Liu%2C%20Sifei%20Yang%2C%20Jimei%20Yang%2C%20Ming-Hsuan%20Generative%20face%20completion%202017",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Li%2C%20Yijun%20Liu%2C%20Sifei%20Yang%2C%20Jimei%20Yang%2C%20Ming-Hsuan%20Generative%20face%20completion%202017"
        },
        {
            "id": "31",
            "entry": "[31] Pengpeng Liu, Xiaojuan Qi, Pinjia He, Yikang Li, Michael R Lyu, and Irwin King. Semantically consistent image completion with fine-grained details. arXiv preprint arXiv:1711.09345, 2017.",
            "arxiv_url": "https://arxiv.org/pdf/1711.09345"
        },
        {
            "id": "32",
            "entry": "[32] Shuang Liu, Olivier Bousquet, and Kamalika Chaudhuri. Approximation and convergence properties of generative adversarial learning. In Advances in Neural Information Processing Systems, pages 5551–5559, 2017.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Liu%2C%20Shuang%20Bousquet%2C%20Olivier%20Chaudhuri%2C%20Kamalika%20Approximation%20and%20convergence%20properties%20of%20generative%20adversarial%20learning%202017",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Liu%2C%20Shuang%20Bousquet%2C%20Olivier%20Chaudhuri%2C%20Kamalika%20Approximation%20and%20convergence%20properties%20of%20generative%20adversarial%20learning%202017"
        },
        {
            "id": "33",
            "entry": "[33] Zhihe Lu, Zhihang Li, Jie Cao, Ran He, and Zhenan Sun. Recent progress of face image synthesis. arXiv preprint arXiv:1706.04717, 2017.",
            "arxiv_url": "https://arxiv.org/pdf/1706.04717"
        },
        {
            "id": "34",
            "entry": "[34] Rahul Mazumder, Trevor Hastie, and Robert Tibshirani. Spectral regularization algorithms for learning large incomplete matrices. Journal of machine learning research, 11(Aug):2287–2322, 2010.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Mazumder%2C%20Rahul%20Hastie%2C%20Trevor%20Tibshirani%2C%20Robert%20Spectral%20regularization%20algorithms%20for%20learning%20large%20incomplete%20matrices%202010",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Mazumder%2C%20Rahul%20Hastie%2C%20Trevor%20Tibshirani%2C%20Robert%20Spectral%20regularization%20algorithms%20for%20learning%20large%20incomplete%20matrices%202010"
        },
        {
            "id": "35",
            "entry": "[35] Patrick E McKnight, Katherine M McKnight, Souraya Sidani, and Aurelio Jose Figueredo. Missing data: A gentle introduction. Guilford Press, 2007.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=McKnight%2C%20Patrick%20E.%20McKnight%2C%20Katherine%20M.%20Sidani%2C%20Souraya%20Figueredo%2C%20Aurelio%20Jose%20Missing%20data%3A%20A%20gentle%20introduction%202007"
        },
        {
            "id": "36",
            "entry": "[36] Mehdi Mirza and Simon Osindero. Conditional generative adversarial nets. arXiv preprint arXiv:1411.1784, 2014.",
            "arxiv_url": "https://arxiv.org/pdf/1411.1784"
        },
        {
            "id": "37",
            "entry": "[37] Vaishnavh Nagarajan and J Zico Kolter. Gradient descent gan optimization is locally stable. In Advances in Neural Information Processing Systems, pages 5591–5600, 2017.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Nagarajan%2C%20Vaishnavh%20Kolter%2C%20J.Zico%20Gradient%20descent%20gan%20optimization%20is%20locally%20stable%202017",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Nagarajan%2C%20Vaishnavh%20Kolter%2C%20J.Zico%20Gradient%20descent%20gan%20optimization%20is%20locally%20stable%202017"
        },
        {
            "id": "38",
            "entry": "[38] Fulufhelo V Nelwamondo, Shakir Mohamed, and Tshilidzi Marwala. Missing data: A comparison of neural network and expectation maximization techniques. Current Science, pages 1514–1521, 2007.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Nelwamondo%2C%20Fulufhelo%20V.%20Mohamed%2C%20Shakir%20Marwala%2C%20Tshilidzi%20Missing%20data%3A%20A%20comparison%20of%20neural%20network%20and%20expectation%20maximization%20techniques%202007",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Nelwamondo%2C%20Fulufhelo%20V.%20Mohamed%2C%20Shakir%20Marwala%2C%20Tshilidzi%20Missing%20data%3A%20A%20comparison%20of%20neural%20network%20and%20expectation%20maximization%20techniques%202007"
        },
        {
            "id": "39",
            "entry": "[39] Sai Rajeswar, Sandeep Subramanian, Francis Dutil, Christopher Pal, and Aaron Courville. Adversarial generation of natural language. arXiv preprint arXiv:1705.10929, 2017.",
            "arxiv_url": "https://arxiv.org/pdf/1705.10929"
        },
        {
            "id": "40",
            "entry": "[40] MATLAB Release. The mathworks. Inc., Natick, Massachusetts, United States, 488, 2013.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Release%2C%20M.A.T.L.A.B.%20The%20mathworks%202013"
        },
        {
            "id": "41",
            "entry": "[41] Thomas Schlegl, Philipp Seeböck, Sebastian M Waldstein, Ursula Schmidt-Erfurth, and Georg",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Schlegl%2C%20Thomas%20Seeb%C3%B6ck%2C%20Philipp%20Waldstein%2C%20Sebastian%20M.%20Ursula"
        },
        {
            "id": "42",
            "entry": "[42] Ikaro Silva, George Moody, Daniel J Scott, Leo A Celi, and Roger G Mark. Predicting inhospital mortality of icu patients: The physionet/computing in cardiology challenge 2012. In Computing in Cardiology (CinC), 2012, pages 245–248. IEEE, 2012.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Ikaro%20Silva%20George%20Moody%20Daniel%20J%20Scott%20Leo%20A%20Celi%20and%20Roger%20G%20Mark%20Predicting%20inhospital%20mortality%20of%20icu%20patients%20The%20physionetcomputing%20in%20cardiology%20challenge%202012%20In%20Computing%20in%20Cardiology%20CinC%202012%20pages%20245248%20IEEE%202012",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Ikaro%20Silva%20George%20Moody%20Daniel%20J%20Scott%20Leo%20A%20Celi%20and%20Roger%20G%20Mark%20Predicting%20inhospital%20mortality%20of%20icu%20patients%20The%20physionetcomputing%20in%20cardiology%20challenge%202012%20In%20Computing%20in%20Cardiology%20CinC%202012%20pages%20245248%20IEEE%202012"
        },
        {
            "id": "43",
            "entry": "[43] Luciana O Silva and Luis E Zárate. A brief review of the main approaches for treatment of missing data. Intelligent Data Analysis, 18(6):1177–1198, 2014.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Silva%2C%20Luciana%20O.%20Z%C3%A1rate%2C%20Luis%20E.%20A%20brief%20review%20of%20the%20main%20approaches%20for%20treatment%20of%20missing%20data%202014",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Silva%2C%20Luciana%20O.%20Z%C3%A1rate%2C%20Luis%20E.%20A%20brief%20review%20of%20the%20main%20approaches%20for%20treatment%20of%20missing%20data%202014"
        },
        {
            "id": "44",
            "entry": "[44] Nitish Srivastava, Geoffrey Hinton, Alex Krizhevsky, Ilya Sutskever, and Ruslan Salakhutdinov. Dropout: A simple way to prevent neural networks from overfitting. The Journal of Machine Learning Research, 15(1):1929–1958, 2014.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Srivastava%2C%20Nitish%20Hinton%2C%20Geoffrey%20Krizhevsky%2C%20Alex%20Sutskever%2C%20Ilya%20Dropout%3A%20A%20simple%20way%20to%20prevent%20neural%20networks%20from%20overfitting%202014",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Srivastava%2C%20Nitish%20Hinton%2C%20Geoffrey%20Krizhevsky%2C%20Alex%20Sutskever%2C%20Ilya%20Dropout%3A%20A%20simple%20way%20to%20prevent%20neural%20networks%20from%20overfitting%202014"
        },
        {
            "id": "45",
            "entry": "[45] Werner Wothke. Longitudinal and multigroup modeling with missing data. 2000.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Wothke%2C%20Werner%20Longitudinal%20and%20multigroup%20modeling%20with%20missing%20data%202000"
        },
        {
            "id": "46",
            "entry": "[46] Jinsung Yoon, James Jordon, and Mihaela van der Schaar. Gain: Missing data imputation using generative adversarial nets. arXiv preprint arXiv:1806.02920, 2018.",
            "arxiv_url": "https://arxiv.org/pdf/1806.02920"
        },
        {
            "id": "47",
            "entry": "[47] Lantao Yu, Weinan Zhang, Jun Wang, and Yong Yu. Seqgan: Sequence generative adversarial nets with policy gradient. In AAAI, pages 2852–2858, 2017.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Yu%2C%20Lantao%20Zhang%2C%20Weinan%20Wang%2C%20Jun%20Yu%2C%20Yong%20Seqgan%3A%20Sequence%20generative%20adversarial%20nets%20with%20policy%20gradient%202017",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Yu%2C%20Lantao%20Zhang%2C%20Weinan%20Wang%2C%20Jun%20Yu%2C%20Yong%20Seqgan%3A%20Sequence%20generative%20adversarial%20nets%20with%20policy%20gradient%202017"
        },
        {
            "id": "48",
            "entry": "[48] Kaiping Zheng, Jinyang Gao, Kee Yuan Ngiam, Beng Chin Ooi, and Wei Luen James Yip. Resolving the bias in electronic medical records. In Proceedings of the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, pages 2171–2180. ACM, 2017. ",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Zheng%2C%20Kaiping%20Gao%2C%20Jinyang%20Kee%20Yuan%20Ngiam%2C%20Beng%20Chin%20Ooi%2C%20and%20Wei%20Luen%20James%20Yip.%20Resolving%20the%20bias%20in%20electronic%20medical%20records%202017",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Zheng%2C%20Kaiping%20Gao%2C%20Jinyang%20Kee%20Yuan%20Ngiam%2C%20Beng%20Chin%20Ooi%2C%20and%20Wei%20Luen%20James%20Yip.%20Resolving%20the%20bias%20in%20electronic%20medical%20records%202017"
        }
    ]
}
