{
    "filename": "7468-bayesian-model-selection-approach-to-boundary-detection-with-non-local-priors.pdf",
    "metadata": {
        "title": "Bayesian Model Selection Approach to Boundary Detection with Non-Local Priors",
        "author": "Fei Jiang, Guosheng Yin, Francesca Dominici",
        "date": 2018,
        "identifiers": {
            "url": "https://papers.nips.cc/paper/7468-bayesian-model-selection-approach-to-boundary-detection-with-non-local-priors.pdf"
        },
        "journal": "Conference on Neural Information Processing Systems",
        "abstract": "Based on non-local prior distributions, we propose a Bayesian model selection (BMS) procedure for boundary detection in a sequence of data with multiple systematic mean changes. The BMS method can effectively suppress the nonboundary spike points with large instantaneous changes. We speed up the algorithm by reducing the multiple change points to a series of single change point detection problems. We establish the consistency of the estimated number and locations of the change points under various prior distributions. Extensive simulation studies are conducted to compare the BMS with existing methods, and our approach is illustrated with application to the magnetic resonance imaging guided radiation therapy data."
    },
    "keywords": [
        {
            "term": "prior distribution",
            "url": "https://en.wikipedia.org/wiki/prior_distribution"
        },
        {
            "term": "data sequence",
            "url": "https://en.wikipedia.org/wiki/data_sequence"
        },
        {
            "term": "bayesian model selection",
            "url": "https://en.wikipedia.org/wiki/bayesian_model_selection"
        }
    ],
    "highlights": [
        "Traditional change point detection algorithms often apply to the situation where the occurrence frequency of the change points is relatively consistent across the signals",
        "Based on non-local prior distributions, we propose a Bayesian model selection (BMS) procedure for boundary detection in a sequence of data with multiple systematic mean changes",
        "Extensive simulation studies are conducted to compare the Bayesian model selection with existing methods, and our approach is illustrated with application to the magnetic resonance imaging guided radiation therapy data",
        "We develop a computationally efficient Bayesian model selection (BMS) approach to identifying multiple change points",
        "We further evaluate the Bayesian model selection, NOT and stepwise marginal likelihood methods based on the data sequences contaminated with spike points",
        "We explore the performance of Bayesian model selection with different tuning parameters, and the resulting patterns are consistent with the theoretical properties"
    ],
    "key_statements": [
        "Traditional change point detection algorithms often apply to the situation where the occurrence frequency of the change points is relatively consistent across the signals",
        "Based on non-local prior distributions, we propose a Bayesian model selection (BMS) procedure for boundary detection in a sequence of data with multiple systematic mean changes",
        "Extensive simulation studies are conducted to compare the Bayesian model selection with existing methods, and our approach is illustrated with application to the magnetic resonance imaging guided radiation therapy data",
        "Traditional change point detection algorithms often apply to the situation where the occurrence frequency of the change points is relatively consistent across the signals",
        "We develop a computationally efficient Bayesian model selection (BMS) approach to identifying multiple change points",
        "Figures A.1 in Appendix shows the change points in the MRgRT data identified by the NOT [1] and stepwise marginal likelihood [5] algorithms respectively, while neither can correctly identify the true boundaries",
        "We further evaluate the Bayesian model selection, NOT and stepwise marginal likelihood methods based on the data sequences contaminated with spike points",
        "We illustrate the Bayesian model selection method with application to the MRgRT data which contain 2265 observations ordered by the distances from the sources of the radiations",
        "We explore the performance of Bayesian model selection with different tuning parameters, and the resulting patterns are consistent with the theoretical properties"
    ],
    "summary": [
        "Traditional change point detection algorithms often apply to the situation where the occurrence frequency of the change points is relatively consistent across the signals.",
        "Based on non-local prior distributions, we propose a Bayesian model selection (BMS) procedure for boundary detection in a sequence of data with multiple systematic mean changes.",
        "We establish the consistency of the estimated number and locations of the change points under various prior distributions.",
        "We develop a computationally efficient Bayesian model selection (BMS) approach to identifying multiple change points.",
        "Figures A.1 in Appendix shows the change points in the MRgRT data identified by the NOT [1] and SML [5] algorithms respectively, while neither can correctly identify the true boundaries.",
        "Because the change points are defined based on the mean changes between two consecutive segments, the local data are sufficient to detect the systemic changes [6, 7, 8, 13, 14, 16, 18, 19].",
        "Yn to be normally distributed to ensure the selection consistency in detecting mean changes, while the Gaussian kernel is used here because it tends to be large when the difference between the true and the hypothetical segment means is small.",
        "To evaluate the performance of the proposed BMS method in the settings without spike points, we generate data from two different models.",
        "We assess the performance of BMS using different priors under model I with a normal error, when p0 is not prespecified.",
        "BMS performs the best in selecting the number of change points and balancing both overand under-segmentation errors.",
        "We further evaluate the BMS, NOT and SML methods based on the data sequences contaminated with spike points.",
        "We generate 500 sequences and each contains n 1000 points with mean changes of",
        "Figure 4 illustrates the change points detection results for three simulated data sequences.",
        "It appears that BMS is the most suitable procedure for this case, because not only does it reinforce the minimal segment length to avoid false identification of spike signals but it retains the minimal segment length to detect change points with small distance gaps.",
        "We illustrate the BMS method with application to the MRgRT data which contain 2265 observations ordered by the distances from the sources of the radiations.",
        "The proposed BMS method can consistently identify multiple mean changes in a data sequence, which effectively removes the flat points without sacrificing the detection accuracy.",
        "The BMS is applied to analyze the MRgRT data for detecting mean changes in the signals, while the NOT, SMT and other methods fail to correctly detect the boundaries.",
        "We demonstrate the robustness of BMS to various error distributions"
    ],
    "headline": "Based on non-local prior distributions, we propose a Bayesian model selection  procedure for boundary detection in a sequence of data with multiple systematic mean changes",
    "reference_links": []
}
