{
    "filename": "7511-a-theory-on-the-absence-of-spurious-solutions-for-nonconvex-and-nonsmooth-optimization.pdf",
    "metadata": {
        "title": "A theory on the absence of spurious solutions for nonconvex and nonsmooth optimization",
        "author": "Cedric Josz, Yi Ouyang, Richard Zhang, Javad Lavaei, Somayeh Sojoudi",
        "date": 2018,
        "identifiers": {
            "url": "https://papers.nips.cc/paper/7511-a-theory-on-the-absence-of-spurious-solutions-for-nonconvex-and-nonsmooth-optimization.pdf"
        },
        "journal": "Conference on Neural Information Processing Systems",
        "abstract": "We study the set of continuous functions that admit no spurious local optima (i.e. local minima that are not global minima) which we term global functions. They satisfy various powerful properties for analyzing nonconvex and nonsmooth optimization problems. For instance, they satisfy a theorem akin to the fundamental uniform limit theorem in the analysis regarding continuous functions. Global functions are also endowed with useful properties regarding the composition of functions and change of variables. Using these new results, we show that a class of nonconvex and nonsmooth optimization problems arising in tensor decomposition applications are global functions. This is the first result concerning nonconvex methods for nonsmooth objective functions. Our result provides a theoretical guarantee for the widely-used 1 norm to avoid outliers in nonconvex optimization."
    },
    "keywords": [
        {
            "term": "local minimum",
            "url": "https://en.wikipedia.org/wiki/local_minimum"
        },
        {
            "term": "neural network",
            "url": "https://en.wikipedia.org/wiki/neural_network"
        },
        {
            "term": "global minimum",
            "url": "https://en.wikipedia.org/wiki/global_minimum"
        },
        {
            "term": "optimization problem",
            "url": "https://en.wikipedia.org/wiki/optimization_problem"
        },
        {
            "term": "matrix completion",
            "url": "https://en.wikipedia.org/wiki/matrix_completion"
        },
        {
            "term": "restricted isometry property",
            "url": "https://en.wikipedia.org/wiki/restricted_isometry_property"
        },
        {
            "term": "continuous function",
            "url": "https://en.wikipedia.org/wiki/continuous_function"
        },
        {
            "term": "stochastic gradient descent",
            "url": "https://en.wikipedia.org/wiki/stochastic_gradient_descent"
        }
    ],
    "highlights": [
        "A recent branch of research in optimization and machine learning consists in proving that simple and practical algorithms can solve nonconvex optimization problems",
        "We study the set of continuous functions that admit no spurious local optima which we term global functions",
        "We show that a class of nonconvex and nonsmooth optimization problems arising in tensor decomposition applications are global functions",
        "Nonconvex optimization appears in many applications, such as matrix completion/sensing, tensor recovery/decomposition, and training of neural networks",
        "For a general nonconvex function, a local search algorithm may become stuck at a local minimum that is arbitrarily worse than a global minimum",
        "Using certain properties of global functions, we show that the set of these functions include a class of nonconvex and nonsmooth functions that arise in matrix completion/sensing and tensor recovery/decomposition with Laplacian noise"
    ],
    "key_statements": [
        "A recent branch of research in optimization and machine learning consists in proving that simple and practical algorithms can solve nonconvex optimization problems",
        "We study the set of continuous functions that admit no spurious local optima which we term global functions",
        "We show that a class of nonconvex and nonsmooth optimization problems arising in tensor decomposition applications are global functions",
        "Nonconvex optimization appears in many applications, such as matrix completion/sensing, tensor recovery/decomposition, and training of neural networks",
        "For a general nonconvex function, a local search algorithm may become stuck at a local minimum that is arbitrarily worse than a global minimum",
        "We develop a new notion of global functions for which all local minima are global minima",
        "Using certain properties of global functions, we show that the set of these functions include a class of nonconvex and nonsmooth functions that arise in matrix completion/sensing and tensor recovery/decomposition with Laplacian noise",
        "Acknowledgments This work was supported by the ONR Awards N00014-17-1-2933 ONR and N00014-18-1-2526, NSF Award 1808859, DARPA Award D16AP00002, and AFOSR Award FA9550-17-1-0163"
    ],
    "summary": [
        "A recent branch of research in optimization and machine learning consists in proving that simple and practical algorithms can solve nonconvex optimization problems.",
        "We show that a class of nonconvex and nonsmooth optimization problems arising in tensor decomposition applications are global functions.",
        "Global functions provide a far simpler and shorter proof to a slightly weaker result, that is to say, the absence of spurious strict local minima.",
        "Another interesting proper subset of G(S) is the set of functions for which, informally, given any point, there exists a strictly decreasing path from that point to a global minimum.",
        "Figure 2a shows that the sequence of global functions pointwise converges to a function with a spurious local minimum.",
        "Figure 2b shows that uniform convergence does not preserve the property of being a global function: all points on the middle part of the limit function are spurious local minima.",
        "We consider the notions of global minimum, local minimum, and strict local minimum (Definition 2.1 and Definition 2.2), which apply to points in Rn, and generalize them to subsets of Rn. We will borrow the notion of neighborhood of a set.",
        "We say that a compact subset X ⊂ S is local minimum of f : S −→ R if there exists > 0 such that for all x ∈ X and for all y ∈ S \\ X satisfying x − y 2 , it holds that f (x) f (y) < f (y)).3 The above definitions are distinct from the notion of valley proposed in [47, Definition 1].",
        "We say that f : S −→ R is a weakly global function if it is continuous and if all strict local minima are global minima in the sense of sets.",
        "To see why each fp is a global function, observe that fp is differentiable with the first-order optimality condition as follows: n xi1 .",
        "Is a weakly global function; in particular, it has no spurious strict local minima.",
        "The notion of weakly global functions explains that one can perform tensor decomposition by minimizing the nonconvex and nonsmooth functions in Proposition 3.1 and Proposition 3.2 with a local search algorithm.",
        "Using certain properties of global functions, we show that the set of these functions include a class of nonconvex and nonsmooth functions that arise in matrix completion/sensing and tensor recovery/decomposition with Laplacian noise.",
        "We wish to thank the anonymous reviewers for their valuable feedback, as well as Chris Dock for fruitful discussions"
    ],
    "headline": "We study the set of continuous functions that admit no spurious local optima  which we term global functions",
    "reference_links": []
}
