{
    "filename": "7731-information-based-adaptive-stimulus-selection-to-optimize-communication-efficiency-in-brain-computer-interfaces.pdf",
    "metadata": {
        "title": "Information-based Adaptive Stimulus Selection to Optimize Communication Efficiency in Brain-Computer Interfaces",
        "author": "Boyla Mainsah, Dmitry Kalika, Leslie Collins, Siyuan Liu, Chandra Throckmorton",
        "date": 2018,
        "identifiers": {
            "url": "https://papers.nips.cc/paper/7731-information-based-adaptive-stimulus-selection-to-optimize-communication-efficiency-in-brain-computer-interfaces.pdf"
        },
        "journal": "Conference on Neural Information Processing Systems",
        "abstract": "Stimulus-driven brain-computer interfaces (BCIs), such as the P300 speller, rely on using a sequence of sensory stimuli to elicit specific neural responses as control signals, while a user attends to relevant target stimuli that occur within the sequence. In current BCIs, the stimulus presentation schedule is typically generated in a pseudo-random fashion. Given the non-stationarity of brain electrical signals, a better strategy could be to adapt the stimulus presentation schedule in real-time by selecting the optimal stimuli that will maximize the signal-to-noise ratios of the elicited neural responses and provide the most information about the user’s intent based on the uncertainties of the data being measured. However, the high-dimensional stimulus space limits the development of algorithms with tractable solutions for optimized stimulus selection to allow for real-time decision-making within the stringent time requirements of BCI processing. We derive a simple analytical solution of an information-based objective function for BCI stimulus selection by transforming the high-dimensional stimulus space into a one-dimensional space that parameterizes the objective function - the prior probability mass of the stimulus under consideration, irrespective of its contents. We demonstrate the utility of our adaptive stimulus selection algorithm in improving BCI performance with results from simulation and real-time human experiments."
    },
    "keywords": [
        {
            "term": "amyotrophic lateral sclerosis",
            "url": "https://en.wikipedia.org/wiki/amyotrophic_lateral_sclerosis"
        },
        {
            "term": "Brain-computer interfaces",
            "url": "https://en.wikipedia.org/wiki/Brain-computer_interfaces"
        },
        {
            "term": "brain computer interface",
            "url": "https://en.wikipedia.org/wiki/brain_computer_interface"
        },
        {
            "term": "Mutual Information",
            "url": "https://en.wikipedia.org/wiki/Mutual_Information"
        },
        {
            "term": "event-related potentials",
            "url": "https://en.wikipedia.org/wiki/event-related_potentials"
        },
        {
            "term": "P300",
            "url": "https://en.wikipedia.org/wiki/P300"
        },
        {
            "term": "computer interface",
            "url": "https://en.wikipedia.org/wiki/computer_interface"
        },
        {
            "term": "objective function",
            "url": "https://en.wikipedia.org/wiki/objective_function"
        },
        {
            "term": "signal-to-noise ratios",
            "url": "https://en.wikipedia.org/wiki/Signal-To-Noise_Ratio"
        },
        {
            "term": "real time",
            "url": "https://en.wikipedia.org/wiki/real_time"
        }
    ],
    "highlights": [
        "Brain-computer interfaces (BCIs) acquire brain signals in real-time, process the signals to extract relevant neural information and translate this information into commands that convey a user’s state or intent to control external devices [<a class=\"ref-link\" id=\"c1\" href=\"#r1\">1</a>]",
        "We have developed a simple, yet powerful analytical solution to an objective function, which allows for computational efficiency in exploring the high dimensional Brain-computer interfaces stimulus space: the objective function is parameterized by the prior probability mass of a future stimulus under consideration, irrespective of its content",
        "We have developed and tested an adaptive stimulus selection algorithm for the P300 Brain-computer interfaces speller that utilizes previous user responses to select future stimuli that are maximally informative of the user’s intent to improve Brain-computer interfaces communication efficiency",
        "We provide a simple parameterization of our objective function in a one-dimensional space that quantifies the prior probability mass of a stimulus under consideration, irrespective of its content",
        "We outlined practical steps to account for Brain-computer interfaces system computational limitations and the potential impact of psychophysical factors during stimulus selection with real-time algorithm implementation",
        "This work focuses on the P300 speller, the methodology developed here for adaptive stimulus selection is applicable to other Brain-computer interfaces that execute a number of possible action queries prior to decision-making"
    ],
    "key_statements": [
        "Brain-computer interfaces (BCIs) acquire brain signals in real-time, process the signals to extract relevant neural information and translate this information into commands that convey a user’s state or intent to control external devices [<a class=\"ref-link\" id=\"c1\" href=\"#r1\">1</a>]",
        "The generation of these neural signals can either be self-initiated, such as with motor imagery, or elicited with sensory stimuli, such as is the case with Brain-computer interfaces based on event-related potentials (ERPs)",
        "In a typical visual P300 speller, a user focuses on a desired character displayed on an interface with M possible options, such as in Figure 1(a), while groups of characters, termed flash groups, are sequentially illuminated on the screen",
        "We have developed a simple, yet powerful analytical solution to an objective function, which allows for computational efficiency in exploring the high dimensional Brain-computer interfaces stimulus space: the objective function is parameterized by the prior probability mass of a future stimulus under consideration, irrespective of its content",
        "The main contributions of this work are as follows: 1) We introduce an adaptive Brain-computer interfaces stimulus selection algorithm, where the objective is to maximize the information content elicited from future stimuli in estimating the user’s intent, based on the neural responses being measured and the Brain-computer interfaces’s current belief regarding the user’s intent; 2) We outline considerations and practical steps for real-time implementation of our adaptive Brain-computer interfaces stimulus selection algorithm; and 3) We present preliminary results from simulation and human Brain-computer interfaces experiments that demonstrate the potential to obtain significant performance improvements with our adaptive stimulus selection algorithm.\n2 Adaptive Stimulus Selection Algorithm\n2.1",
        "To facilitate correct target character estimation in as few stimulus presentations as possible, we use an information-based criterion [<a class=\"ref-link\" id=\"c20\" href=\"#r20\">20</a>] to bias the stimulus selection process towards stimuli that provide the most information to the Brain-computer interfaces to correctly estimate the user’s intent given the current data",
        "Assuming the Bayesian algorithm (1)-(3), we use the following objective function based on mutual information to select a flash group at each time step : I(Yth+1; C∗|yt, fht+1) = =",
        "The open source BCI2000 software [<a class=\"ref-link\" id=\"c23\" href=\"#r23\">23</a>] was used to implement the P300 speller with the Bayesian Dynamic stopping algorithm, with the stopping probability threshold and data collection limit set to Pth = 0.9 and 145 stimulus flashes, respectively",
        "We have developed and tested an adaptive stimulus selection algorithm for the P300 Brain-computer interfaces speller that utilizes previous user responses to select future stimuli that are maximally informative of the user’s intent to improve Brain-computer interfaces communication efficiency",
        "We provide a simple parameterization of our objective function in a one-dimensional space that quantifies the prior probability mass of a stimulus under consideration, irrespective of its content",
        "We outlined practical steps to account for Brain-computer interfaces system computational limitations and the potential impact of psychophysical factors during stimulus selection with real-time algorithm implementation",
        "This work focuses on the P300 speller, the methodology developed here for adaptive stimulus selection is applicable to other Brain-computer interfaces that execute a number of possible action queries prior to decision-making"
    ],
    "summary": [
        "Brain-computer interfaces (BCIs) acquire brain signals in real-time, process the signals to extract relevant neural information and translate this information into commands that convey a user’s state or intent to control external devices [<a class=\"ref-link\" id=\"c1\" href=\"#r1\">1</a>].",
        "The BCI stimulus selection process can be adapted in real-time based on the data that is currently measured to maximize the elicited neural responses [<a class=\"ref-link\" id=\"c15\" href=\"#r15\">15</a>, <a class=\"ref-link\" id=\"c16\" href=\"#r16\">16</a>].",
        "To facilitate correct target character estimation in as few stimulus presentations as possible, we use an information-based criterion [<a class=\"ref-link\" id=\"c20\" href=\"#r20\">20</a>] to bias the stimulus selection process towards stimuli that provide the most information to the BCI to correctly estimate the user’s intent given the current data.",
        "Assuming the Bayesian algorithm (1)-(3), we use the following objective function based on mutual information to select a flash group at each time step : I(Yth+1; C∗|yt, fht+1) = =",
        "Flash group for the implementation as there is a delay between presenting a stimulus and computing the corresponding classifier score due to processing a time window of EEG data, as illustrated in Figure 3.",
        "Selection accuracy and the average number of flash group presentations prior to character selection, denoted as the expected stopping time (EST), were estimated with results averaged over 1500 simulation runs.",
        "The open source BCI2000 software [<a class=\"ref-link\" id=\"c23\" href=\"#r23\">23</a>] was used to implement the P300 speller with the Bayesian DS algorithm, with the stopping probability threshold and data collection limit set to Pth = 0.9 and 145 stimulus flashes, respectively.",
        "Based on the stochastic progression of the classifier scores, the mean probability of the target character should increase progressively over time, with a faster rate of convergence in a better-performing stimulus paradigm, assuming the same performance level across paradigms.",
        "Half of the participants achieved higher spelling speeds with our adaptive stimulus paradigm while maintaining similar accuracy levels as with the CB paradigm, which is generally illustrated in Figure 6 by the faster algorithm convergence of the mean target character probability in the participants.",
        "We hypothesize that the occasional decline in the mean target character probability at higher stopping times is a negative consequence of the increased adjacency distractions and user fatigue that occur as a result of the repetitive presentations of characters around the target character in the adaptive stimulus paradigm.",
        "We have developed and tested an adaptive stimulus selection algorithm for the P300 BCI speller that utilizes previous user responses to select future stimuli that are maximally informative of the user’s intent to improve BCI communication efficiency.",
        "We believe that the limitations associated with a grid interface layout can be addressed with additional refinements of the stimulus space constraints, such as imposing spatial restrictions on characters within a flash group to minimize adjacency distractions.",
        "This work focuses on the P300 speller, the methodology developed here for adaptive stimulus selection is applicable to other BCIs that execute a number of possible action queries prior to decision-making"
    ],
    "headline": "We demonstrate the utility of our adaptive stimulus selection algorithm in improving Brain-computer interfaces performance with results from simulation and real-time human experiments",
    "reference_links": [
        {
            "id": "1",
            "entry": "[1] J. R. Wolpaw and E. W. Wolpaw, Brain-computer interfaces: principles and practice. New York: Oxford University Press, 2012.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Wolpaw%2C%20J.R.%20Wolpaw%2C%20E.W.%20Brain-computer%20interfaces%3A%20principles%20and%20practice%202012"
        },
        {
            "id": "2",
            "entry": "[2] R. A. Ramadan and A. V. Vasilakos, “Brain computer interface: control signals review,” Neurocomputing, vol. 223, pp. 26–44, 2017.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Ramadan%2C%20R.A.%20Vasilakos%2C%20A.V.%20Brain%20computer%20interface%3A%20control%20signals%20review%2C%202017",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Ramadan%2C%20R.A.%20Vasilakos%2C%20A.V.%20Brain%20computer%20interface%3A%20control%20signals%20review%2C%202017"
        },
        {
            "id": "3",
            "entry": "[3] S. Moghimi, A. Kushki, A. M. Guerguerian, and T. Chau, “A review of EEG-based brain-computer interfaces as access pathways for individuals with severe disabilities,” Assistive Technology, vol. 25, no. 2, pp. 99–110, 2013.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Moghimi%2C%20S.%20Kushki%2C%20A.%20Guerguerian%2C%20A.M.%20Chau%2C%20T.%20A%20review%20of%20EEG-based%20brain-computer%20interfaces%20as%20access%20pathways%20for%20individuals%20with%20severe%20disabilities%2C%202013",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Moghimi%2C%20S.%20Kushki%2C%20A.%20Guerguerian%2C%20A.M.%20Chau%2C%20T.%20A%20review%20of%20EEG-based%20brain-computer%20interfaces%20as%20access%20pathways%20for%20individuals%20with%20severe%20disabilities%2C%202013"
        },
        {
            "id": "4",
            "entry": "[4] L. A. Farwell and E. Donchin, “Talking off the top of your head: toward a mental prosthesis utilizing event-related brain potentials,” Electroencephalography and Clinical Neurophysiology, vol. 70, no. 6, pp. 510–523, 1988.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Farwell%2C%20L.A.%20Donchin%2C%20E.%20Talking%20off%20the%20top%20of%20your%20head%3A%20toward%20a%20mental%20prosthesis%20utilizing%20event-related%20brain%20potentials%2C%201988",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Farwell%2C%20L.A.%20Donchin%2C%20E.%20Talking%20off%20the%20top%20of%20your%20head%3A%20toward%20a%20mental%20prosthesis%20utilizing%20event-related%20brain%20potentials%2C%201988"
        },
        {
            "id": "5",
            "entry": "[5] B. O. Mainsah, L. M. Collins, K. A. Colwell, E. W. Sellers, D. B. Ryan, K. Caves, and C. S. Throckmorton, “Increasing BCI communication rates with dynamic stopping towards more practical use: an als study,” Journal of Neural Engineering, vol. 12, no. 1, p. 016013, 2015.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Mainsah%2C%20B.O.%20Collins%2C%20L.M.%20Colwell%2C%20K.A.%20Sellers%2C%20E.W.%20Increasing%20BCI%20communication%20rates%20with%20dynamic%20stopping%20towards%20more%20practical%20use%3A%20an%20als%20study%2C%202015",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Mainsah%2C%20B.O.%20Collins%2C%20L.M.%20Colwell%2C%20K.A.%20Sellers%2C%20E.W.%20Increasing%20BCI%20communication%20rates%20with%20dynamic%20stopping%20towards%20more%20practical%20use%3A%20an%20als%20study%2C%202015"
        },
        {
            "id": "6",
            "entry": "[6] J. M. Clearwater, C. C. Kerr, C. J. Rennie, and P. A. Robinson, “Neural mechanisms of ERP change: combining insights from electrophysiology and mathematical modeling,” Journal of Integrative Neuroscience, vol. 7, no. 04, pp. 529–550, 2008.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Clearwater%2C%20J.M.%20Kerr%2C%20C.C.%20Rennie%2C%20C.J.%20Robinson%2C%20P.A.%20Neural%20mechanisms%20of%20ERP%20change%3A%20combining%20insights%20from%20electrophysiology%20and%20mathematical%20modeling%2C%202008",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Clearwater%2C%20J.M.%20Kerr%2C%20C.C.%20Rennie%2C%20C.J.%20Robinson%2C%20P.A.%20Neural%20mechanisms%20of%20ERP%20change%3A%20combining%20insights%20from%20electrophysiology%20and%20mathematical%20modeling%2C%202008"
        },
        {
            "id": "7",
            "entry": "[7] S. M. M. Martens, N. J. Hill, J. Farquhar, and B. Scholkopf, “Overlap and refractory effects in a braincomputer interface speller based on the visual P300 event-related potential,” Journal of Neural Engineering, vol. 6, no. 2, 2009.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Martens%2C%20S.M.M.%20Hill%2C%20N.J.%20Farquhar%2C%20J.%20Scholkopf%2C%20B.%20Overlap%20and%20refractory%20effects%20in%20a%20braincomputer%20interface%20speller%20based%20on%20the%20visual%20P300%20event-related%20potential%2C%202009",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Martens%2C%20S.M.M.%20Hill%2C%20N.J.%20Farquhar%2C%20J.%20Scholkopf%2C%20B.%20Overlap%20and%20refractory%20effects%20in%20a%20braincomputer%20interface%20speller%20based%20on%20the%20visual%20P300%20event-related%20potential%2C%202009"
        },
        {
            "id": "8",
            "entry": "[8] K. Squires, S. Petuchowski, C. Wickens, and E. Donchin, “The effects of stimulus sequence on event related potentials: A comparison of visual and auditory sequences,” Perception & Psychophysics, vol. 22, no. 1, pp. 31–40, 1977.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Squires%2C%20K.%20Petuchowski%2C%20S.%20Wickens%2C%20C.%20Donchin%2C%20E.%20The%20effects%20of%20stimulus%20sequence%20on%20event%20related%20potentials%3A%20A%20comparison%20of%20visual%20and%20auditory%20sequences%2C%201977",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Squires%2C%20K.%20Petuchowski%2C%20S.%20Wickens%2C%20C.%20Donchin%2C%20E.%20The%20effects%20of%20stimulus%20sequence%20on%20event%20related%20potentials%3A%20A%20comparison%20of%20visual%20and%20auditory%20sequences%2C%201977"
        },
        {
            "id": "9",
            "entry": "[9] G. Townsend, B. K. LaPallo, C. B. Boulay, D. J. Krusienski, G. E. Frye, C. K. Hauser, N. E. Schwartz, T. M. Vaughan, J. R. Wolpaw, and E. W. Sellers, “A novel P300-based brain-computer interface stimulus presentation paradigm: moving beyond rows and columns,” Clinical Neurophysiology, vol. 121, no. 7, pp. 1109–20, 2010.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Townsend%2C%20G.%20LaPallo%2C%20B.K.%20Boulay%2C%20C.B.%20Krusienski%2C%20D.J.%20A%20novel%20P300-based%20brain-computer%20interface%20stimulus%20presentation%20paradigm%3A%20moving%20beyond%20rows%20and%20columns%2C%202010",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Townsend%2C%20G.%20LaPallo%2C%20B.K.%20Boulay%2C%20C.B.%20Krusienski%2C%20D.J.%20A%20novel%20P300-based%20brain-computer%20interface%20stimulus%20presentation%20paradigm%3A%20moving%20beyond%20rows%20and%20columns%2C%202010"
        },
        {
            "id": "10",
            "entry": "[10] J. Hill, J. Farquhar, S. Martens, F. Biessmann, and B. Scholkopf, “Effects of stimulus type and of errorcorrecting code design on BCI speller performance,” in Advances in Neural Information Processing Systems. Curran Associates, Inc., 2009, pp. 665–672.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Hill%2C%20J.%20Farquhar%2C%20J.%20Martens%2C%20S.%20Biessmann%2C%20F.%20Effects%20of%20stimulus%20type%20and%20of%20errorcorrecting%20code%20design%20on%20BCI%20speller%20performance%2C%202009",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Hill%2C%20J.%20Farquhar%2C%20J.%20Martens%2C%20S.%20Biessmann%2C%20F.%20Effects%20of%20stimulus%20type%20and%20of%20errorcorrecting%20code%20design%20on%20BCI%20speller%20performance%2C%202009"
        },
        {
            "id": "11",
            "entry": "[11] S. M. M. Martens, J. M. Mooij, N. J. Hill, J. Farquhar, and B. Scholkopf, “A graphical model framework for decoding in the visual ERP-based BCI speller,” Neural Computation, vol. 23, no. 1, pp. 160–182, 2011.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Martens%2C%20S.M.M.%20Mooij%2C%20J.M.%20Hill%2C%20N.J.%20Farquhar%2C%20J.%20A%20graphical%20model%20framework%20for%20decoding%20in%20the%20visual%20ERP-based%20BCI%20speller%2C%202011",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Martens%2C%20S.M.M.%20Mooij%2C%20J.M.%20Hill%2C%20N.J.%20Farquhar%2C%20J.%20A%20graphical%20model%20framework%20for%20decoding%20in%20the%20visual%20ERP-based%20BCI%20speller%2C%202011"
        },
        {
            "id": "12",
            "entry": "[12] T. Verhoeven, P. Buteneers, J. R. Wiersema, J. Dambre, and P. Kindermans, “Towards a symbiotic braincomputer interface: exploring the application-decoder interaction,” Journal of Neural Engineering, vol. 12, no. 6, p. 066027, 2015.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Verhoeven%2C%20T.%20Buteneers%2C%20P.%20Wiersema%2C%20J.R.%20Dambre%2C%20J.%20Towards%20a%20symbiotic%20braincomputer%20interface%3A%20exploring%20the%20application-decoder%20interaction%2C%202015",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Verhoeven%2C%20T.%20Buteneers%2C%20P.%20Wiersema%2C%20J.R.%20Dambre%2C%20J.%20Towards%20a%20symbiotic%20braincomputer%20interface%3A%20exploring%20the%20application-decoder%20interaction%2C%202015"
        },
        {
            "id": "13",
            "entry": "[13] B. O. Mainsah, G. Reeves, L. M. Collins, and C. S. Throckmorton, “Optimizing the stimulus presentation paradigm design for the P300-based brain-computer interface using performance prediction,” Journal of Neural Engineering, vol. 14, no. 4, p. 046025, 2017.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Mainsah%2C%20B.O.%20Reeves%2C%20G.%20Collins%2C%20L.M.%20Throckmorton%2C%20C.S.%20Optimizing%20the%20stimulus%20presentation%20paradigm%20design%20for%20the%20P300-based%20brain-computer%20interface%20using%20performance%20prediction%2C%202017",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Mainsah%2C%20B.O.%20Reeves%2C%20G.%20Collins%2C%20L.M.%20Throckmorton%2C%20C.S.%20Optimizing%20the%20stimulus%20presentation%20paradigm%20design%20for%20the%20P300-based%20brain-computer%20interface%20using%20performance%20prediction%2C%202017"
        },
        {
            "id": "14",
            "entry": "[14] J. N. Mak, Y. Arbel, J. W. Minett, L. M. McCane, B. Yuksel, D. Ryan, D. Thompson, L. Bianchi, and D. Erdogmus, “Optimizing the P300-based brain–computer interface: current status, limitations and future directions,” Journal of Neural Engineering, vol. 8, no. 2, p. 025003, 2011.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Mak%2C%20J.N.%20Arbel%2C%20Y.%20Minett%2C%20J.W.%20McCane%2C%20L.M.%20Optimizing%20the%20P300-based%20brain%E2%80%93computer%20interface%3A%20current%20status%2C%20limitations%20and%20future%20directions%2C%202011",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Mak%2C%20J.N.%20Arbel%2C%20Y.%20Minett%2C%20J.W.%20McCane%2C%20L.M.%20Optimizing%20the%20P300-based%20brain%E2%80%93computer%20interface%3A%20current%20status%2C%20limitations%20and%20future%20directions%2C%202011"
        },
        {
            "id": "15",
            "entry": "[15] C. DiMattina and K. Zhang, “Adaptive stimulus optimization for sensory systems neuroscience,” Frontiers in Neural Circuits, vol. 7, p. 101, 2013.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=DiMattina%2C%20C.%20Zhang%2C%20K.%20Adaptive%20stimulus%20optimization%20for%20sensory%20systems%20neuroscience%2C%202013",
            "oa_query": "https://api.scholarcy.com/oa_version?query=DiMattina%2C%20C.%20Zhang%2C%20K.%20Adaptive%20stimulus%20optimization%20for%20sensory%20systems%20neuroscience%2C%202013"
        },
        {
            "id": "16",
            "entry": "[16] B. Cowley, R. Williamson, K. Clemens, M. Smith, and M. Y. Byron, “Adaptive stimulus selection for optimizing neural population responses,” in Advances in Neural Information Processing Systems, 2017, pp. 1395–1405.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Cowley%2C%20B.%20Williamson%2C%20R.%20Clemens%2C%20K.%20Smith%2C%20M.%20Adaptive%20stimulus%20selection%20for%20optimizing%20neural%20population%20responses%2C%202017",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Cowley%2C%20B.%20Williamson%2C%20R.%20Clemens%2C%20K.%20Smith%2C%20M.%20Adaptive%20stimulus%20selection%20for%20optimizing%20neural%20population%20responses%2C%202017"
        },
        {
            "id": "17",
            "entry": "[17] J. Park and K.-E. Kim, “A POMDP approach to optimizing P300 speller BCI paradigm,” IEEE Transactions on Neural Systems and Rehabilitation Engineering, vol. 20, no. 4, pp. 584–594, 2012.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Park%2C%20J.%20Kim%2C%20K.-E.%20A%20POMDP%20approach%20to%20optimizing%20P300%20speller%20BCI%20paradigm%2C%202012",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Park%2C%20J.%20Kim%2C%20K.-E.%20A%20POMDP%20approach%20to%20optimizing%20P300%20speller%20BCI%20paradigm%2C%202012"
        },
        {
            "id": "18",
            "entry": "[18] P. Varona, D. A. Guardeno, T. Nowotny, and F. d. B. R. Ortiz, “Online event detection requirements in closed-loop neuroscience,” in Closed Loop Neuroscience, 2016, pp. 81–91.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Varona%2C%20P.%20Guardeno%2C%20D.A.%20Nowotny%2C%20T.%20d.%20B.%20R.%20Ortiz%2C%20F.%20%E2%80%9COnline%20event%20detection%20requirements%20in%20closed-loop%20neuroscience%2C%E2%80%9D%20in%20Closed%20Loop%202016",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Varona%2C%20P.%20Guardeno%2C%20D.A.%20Nowotny%2C%20T.%20d.%20B.%20R.%20Ortiz%2C%20F.%20%E2%80%9COnline%20event%20detection%20requirements%20in%20closed-loop%20neuroscience%2C%E2%80%9D%20in%20Closed%20Loop%202016"
        },
        {
            "id": "19",
            "entry": "[19] C. S. Throckmorton, K. A. Colwell, D. B. Ryan, E. W. Sellers, and L. M. Collins, “Bayesian approach to dynamically controlling data collection in P300 spellers,” IEEE Transactions on Neural Systems and Rehabilitation Engineering, vol. 21, no. 3, pp. 508–17, 2013.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Throckmorton%2C%20C.S.%20Colwell%2C%20K.A.%20Ryan%2C%20D.B.%20Sellers%2C%20E.W.%20Bayesian%20approach%20to%20dynamically%20controlling%20data%20collection%20in%20P300%20spellers%2C%202013",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Throckmorton%2C%20C.S.%20Colwell%2C%20K.A.%20Ryan%2C%20D.B.%20Sellers%2C%20E.W.%20Bayesian%20approach%20to%20dynamically%20controlling%20data%20collection%20in%20P300%20spellers%2C%202013"
        },
        {
            "id": "20",
            "entry": "[20] K. Kastella, “Discrimination gain to optimize detection and classification,” IEEE Transactions on Systems, Man, and Cybernetics-Part A: Systems and Humans, vol. 27, no. 1, pp. 112–116, 1997.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Kastella%2C%20K.%20Discrimination%20gain%20to%20optimize%20detection%20and%20classification%2C%201997",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Kastella%2C%20K.%20Discrimination%20gain%20to%20optimize%20detection%20and%20classification%2C%201997"
        },
        {
            "id": "21",
            "entry": "[21] T. M. Cover and J. A. Thomas, Elements of Information Theory. John Wiley & Sons, 2006.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Cover%2C%20T.M.%20Thomas%2C%20J.A.%20Elements%20of%20Information%20Theory%202006"
        },
        {
            "id": "22",
            "entry": "[22] B. O. Mainsah, L. M. Collins, and C. S. Throckmorton, “Using the detectability index to predict P300 speller performance,” Journal of Neural Engineering, vol. 13, no. 6, p. 066007, 2016.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Mainsah%2C%20B.O.%20Collins%2C%20L.M.%20Throckmorton%2C%20C.S.%20Using%20the%20detectability%20index%20to%20predict%20P300%20speller%20performance%2C%202016",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Mainsah%2C%20B.O.%20Collins%2C%20L.M.%20Throckmorton%2C%20C.S.%20Using%20the%20detectability%20index%20to%20predict%20P300%20speller%20performance%2C%202016"
        },
        {
            "id": "23",
            "entry": "[23] G. Schalk and J. Mellinger, A Practical Guide to Brain-Computer Interfacing with BCI2000: General- Purpose Software for Brain-Computer Interface Research, Data Acquisition, Stimulus Presentation, and Brain Monitoring. Springer, 2010.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Schalk%2C%20G.%20Mellinger%2C%20J.%20A%20Practical%20Guide%20to%20Brain-Computer%20Interfacing%20with%20BCI2000%3A%20General-%20Purpose%20Software%20for%20Brain-Computer%20Interface%20Research%2C%20Data%20Acquisition%2C%20Stimulus%20Presentation%2C%20and%20Brain%20Monitoring%202010"
        },
        {
            "id": "24",
            "entry": "[24] D. J. Krusienski, E. W. Sellers, D. J. McFarland, T. M. Vaughan, and J. R. Wolpaw, “Toward enhanced P300 speller performance,” Journal of Neuroscience Methods, vol. 167, no. 1, pp. 15–21, 2008.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Krusienski%2C%20D.J.%20Sellers%2C%20E.W.%20McFarland%2C%20D.J.%20Vaughan%2C%20T.M.%20Toward%20enhanced%20P300%20speller%20performance%2C%202008",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Krusienski%2C%20D.J.%20Sellers%2C%20E.W.%20McFarland%2C%20D.J.%20Vaughan%2C%20T.M.%20Toward%20enhanced%20P300%20speller%20performance%2C%202008"
        },
        {
            "id": "25",
            "entry": "[25] S. Lees, N. Dayan, H. Cecotti, P. Mccullagh, L. Maguire, F. Lotte, and D. Coyle, “A review of rapid serial visual presentation-based brain–computer interfaces,” Journal of Neural Engineering, vol. 15, no. 2, p. 021001, 2018. ",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Lees%2C%20S.%20Dayan%2C%20N.%20Cecotti%2C%20H.%20Mccullagh%2C%20P.%20A%20review%20of%20rapid%20serial%20visual%20presentation-based%20brain%E2%80%93computer%20interfaces%2C%202018",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Lees%2C%20S.%20Dayan%2C%20N.%20Cecotti%2C%20H.%20Mccullagh%2C%20P.%20A%20review%20of%20rapid%20serial%20visual%20presentation-based%20brain%E2%80%93computer%20interfaces%2C%202018"
        }
    ]
}
