{
    "filename": "8068-generalisation-of-structural-knowledge-in-the-hippocampal-entorhinal-system.pdf",
    "metadata": {
        "title": "Generalisation of structural knowledge in the hippocampal-entorhinal system",
        "date": 2018,
        "author": "James C.R. Whittington* University of Oxford, UK james.whittington@magd.ox.ac.uk",
        "identifiers": {
            "url": "https://papers.nips.cc/paper/8068-generalisation-of-structural-knowledge-in-the-hippocampal-entorhinal-system.pdf"
        },
        "journal": "Conference on Neural Information Processing Systems",
        "abstract": "A central problem to understanding intelligence is the concept of generalisation. This allows previously learnt structure to be exploited to solve tasks in novel situations differing in their particularities. We take inspiration from neuroscience, specifically the hippocampal-entorhinal system known to be important for generalisation. We propose that to generalise structural knowledge, the representations of the structure of the world, i.e. how entities in the world relate to each other, need to be separated from representations of the entities themselves. We show, under these principles, artificial neural networks embedded with hierarchy and fast Hebbian memory, can learn the statistics of memories and generalise structural knowledge. Spatial neuronal representations mirroring those found in the brain emerge, suggesting spatial cognition is an instance of more general organising principles. We further unify many entorhinal cell types as basis functions for constructing transition graphs, and show these representations effectively utilise memories. We experimentally support model assumptions, showing a preserved relationship between entorhinal grid and hippocampal place cells across environments."
    },
    "keywords": [
        {
            "term": "place cell",
            "url": "https://en.wikipedia.org/wiki/place_cell"
        },
        {
            "term": "artificial intelligence",
            "url": "https://en.wikipedia.org/wiki/artificial_intelligence"
        },
        {
            "term": "artificial neural networks",
            "url": "https://en.wikipedia.org/wiki/artificial_neural_networks"
        },
        {
            "term": "entorhinal cortex",
            "url": "https://en.wikipedia.org/wiki/entorhinal_cortex"
        },
        {
            "term": "grid cell",
            "url": "https://en.wikipedia.org/wiki/grid_cell"
        }
    ],
    "highlights": [
        "In spatial navigation there is a good understanding of neuronal representations in both hippocampus and medial entorhinal cortex",
        "We propose the statistics of memories in hippocampus are extracted by cortex [<a class=\"ref-link\" id=\"c30\" href=\"#r30\">30</a>], and future hippocampal representations/memories are constrained to be consistent with the learned structural knowledge",
        "Neuroscience: We found an interpretation of grid cells, place cells and remapping that offers a mechanistic understanding for the hippocampal involvement in generalisation of knowledge across domains",
        "We proposed a mechanism for generalisation of structure inspired by the hippocampal-entorhinal system",
        "We have proposed that entorhinal cortex provides a basis set for describing the current transition structure, unifying many entorhinal cell types",
        "We have presented experimental evidence that demonstrates grid and place cells retain their relationships across environment, which supports our model assumptions"
    ],
    "key_statements": [
        "In spatial navigation there is a good understanding of neuronal representations in both hippocampus and medial entorhinal cortex",
        "We propose the statistics of memories in hippocampus are extracted by cortex [<a class=\"ref-link\" id=\"c30\" href=\"#r30\">30</a>], and future hippocampal representations/memories are constrained to be consistent with the learned structural knowledge",
        "We find this an interesting system to model using artificial neural networks (ANNs), as it may offer insights into generalisation for machines, further our understanding of the biological system itself, and continue to link neuroscience and artificial intelligence research [<a class=\"ref-link\" id=\"c20\" href=\"#r20\">20</a>, <a class=\"ref-link\" id=\"c41\" href=\"#r41\">41</a>]",
        "In spatial navigation there is a good understanding of neuronal representations in both hippocampus and medial entorhinal cortex",
        "We further present analyses of a remapping experiment [<a class=\"ref-link\" id=\"c6\" href=\"#r6\">6</a>], which support our model assumptions, showing place cells remap to locations consistent with a grid code, i.e. not randomly as previously thought",
        "Neuroscience: We found an interpretation of grid cells, place cells and remapping that offers a mechanistic understanding for the hippocampal involvement in generalisation of knowledge across domains",
        "We propose that this learnt structural knowledge constrains hippocampal representations in new contexts, allowing reuse of learnt knowledge",
        "We propose grid cells as bases for constructing abstract representations of space, and place cell representations for the formation of fast episodic memories (Fig 2a)",
        "To link a stimulus to a given location, a memory should be a conjunction of abstract location and sensory stimulus, we propose place cells form a conjunctive representation between the sensorium and grid input (Figs 1a and 2a)",
        "We presented a probabilistic formulation, best results were obtained when only considering the means of each distribution",
        "We observe the appearance of phases in the grid cells, i.e. we find grid representations that are shifted versions of each other, as in the brain [<a class=\"ref-link\" id=\"c18\" href=\"#r18\">18</a>]",
        "Our results suggest that the ’zoo’ of different cell types found in entorhinal cortex may be viewed under a unified framework - summarising the common statistics of tasks into basis functions that can be flexibly combined depending on the particular structural constraints of the environment the animal/agent faces",
        "Whether grid cell activity at the position of peak place cell activity is correlated across environments, and second, whether the minimum distance between the peak place cell activity and a peak of grid cell activity is correlated across environments",
        "We present analyses for both the gridAtPlace measure (Fig 7a) and the minDist measure (Fig 7b)",
        "The grid cell correlation matrix is preserved across environments (p < 0.001 from null), both in the data [<a class=\"ref-link\" id=\"c6\" href=\"#r6\">6</a>] as well as in our model (Fig 7c bottom). These results are consistent with the notion that grid cells encode generalisable structural knowledge. These are the first analyses demonstrating non-random place cell remapping based on neural activity, and provide evidence for a key prediction of our model: that place cells, despite remapping across environments, retain their relationship with grid cells",
        "We proposed a mechanism for generalisation of structure inspired by the hippocampal-entorhinal system",
        "We proposed that one can generalise state-space statistics via explicit separation of structure and stimuli, while using a conjunctive representation with fast memory to link the two",
        "We proposed that spatial hierarchies are utilised to allow for an efficient combinatorial code",
        "We have shown that hierarchical grid-like and place-like representations emerge naturally from our model in a purely unsupervised learning setting",
        "We have shown that these representations are effective at both generalising the state-space, but for hierarchical memory addressing",
        "We have proposed that entorhinal cortex provides a basis set for describing the current transition structure, unifying many entorhinal cell types",
        "We have suggested that spatial coding is just one instance of a broader framework organising knowledge",
        "We have presented experimental evidence that demonstrates grid and place cells retain their relationships across environment, which supports our model assumptions",
        "We hope that this work can provide new insights that will allow for advances in artificial intelligence, as well as providing new predictions, constraints and understanding in Neuroscience.\n7 Author Contributions"
    ],
    "summary": [
        "In spatial navigation there is a good understanding of neuronal representations in both hippocampus and medial entorhinal cortex.",
        "We propose place cells form a conjunctive representation between structural and sensory input, and remap to non-random locations consistent with this conjunction.",
        "This conjunctive representation forms a Hebbian memory, which bridges structure and identity, allowing the same structural code to be reused across environments that share statistics but differ in sensory experiences.",
        "To link a stimulus to a given location, a memory should be a conjunction of abstract location and sensory stimulus, we propose place cells form a conjunctive representation between the sensorium and grid input (Figs 1a and 2a).",
        "We use the following learning rule to update the memory: Mt = λ Mt−1 +ηT , where pt represents place cells generated from inferred grid cells.",
        "This is a different notion to other remapping models [<a class=\"ref-link\" id=\"c1\" href=\"#r1\">1</a>], where random grid modular realignment produces a new set of place cells, and learning, that anchors these new representations, starts afresh in each environment.",
        "We show that by predicting sensory observations in environments that share structure, the model learns to generalise structural knowledge.",
        "Our results suggest that the ’zoo’ of different cell types found in entorhinal cortex may be viewed under a unified framework - summarising the common statistics of tasks into basis functions that can be flexibly combined depending on the particular structural constraints of the environment the animal/agent faces.",
        "These grid-like representations allow zero shot inference in new worlds demonstrating structural generalisation.",
        "We empirically test this prediction in data from a remapping experiment [<a class=\"ref-link\" id=\"c6\" href=\"#r6\">6</a>] where both place and grid cells were recorded from rats in two different environments.",
        "We test across environments, to asses whether our predicted non-random remapping relationship between grid and place cells exists (Fig 7a, bottom and 7b, bottom).",
        "The grid cell correlation matrix is preserved across environments (p < 0.001 from null), both in the data [<a class=\"ref-link\" id=\"c6\" href=\"#r6\">6</a>] as well as in our model (Fig 7c bottom).",
        "These are the first analyses demonstrating non-random place cell remapping based on neural activity, and provide evidence for a key prediction of our model: that place cells, despite remapping across environments, retain their relationship with grid cells.",
        "We proposed that one can generalise state-space statistics via explicit separation of structure and stimuli, while using a conjunctive representation with fast memory to link the two.",
        "We have presented experimental evidence that demonstrates grid and place cells retain their relationships across environment, which supports our model assumptions.",
        "We hope that this work can provide new insights that will allow for advances in AI, as well as providing new predictions, constraints and understanding in Neuroscience"
    ],
    "headline": "We propose that to generalise structural knowledge, the representations of the structure of the world, i.e. how entities in the world relate to each other, need to be separated from representations of the entities themselves",
    "reference_links": [
        {
            "id": "1",
            "entry": "[1] Larry F. Abbott, J. D. Monaco, and Larry F. Abbott. Modular Realignment of Entorhinal Grid Cell Activity as a Basis for Hippocampal Remapping. Journal of Neuroscience, 31(25):9414–9425, 2011. ISSN 0270-6474. doi: 10.1523/JNEUROSCI.1433-11.2011. URL http://www.jneurosci.org/cgi/doi/10.1523/JNEUROSCI.1433-11.2011.",
            "crossref": "https://dx.doi.org/10.1523/JNEUROSCI.1433-11.2011",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1523/JNEUROSCI.1433-11.2011"
        },
        {
            "id": "2",
            "entry": "[2] Dmitriy Aronov, Rhino Nevers, and David W. Tank. Mapping of a non-spatial dimension by the hippocampal–entorhinal circuit. Nature, 543(7647):719–722, 2017. ISSN 0028-0836. doi: 10.1038/nature21692. URL http://www.nature.com/doifinder/10.1038/nature21692.",
            "crossref": "https://dx.doi.org/10.1038/nature21692",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1038/nature21692"
        },
        {
            "id": "3",
            "entry": "[3] Jimmy Lei Ba, Geoffrey Hinton, Volodymyr Mnih, Joel Z. Leibo, and Catalin Ionescu. Using Fast Weights to Attend to the Recent Past. Advances in Neural Information Processing Systems, pages 1–10, 2016. URL http://arxiv.org/abs/1610.06258.",
            "url": "http://arxiv.org/abs/1610.06258",
            "arxiv_url": "https://arxiv.org/pdf/1610.06258"
        },
        {
            "id": "4",
            "entry": "[4] Jimmy Lei Ba, Jamie Ryan Kiros, and Geoffrey E. Hinton. Layer Normalization. arXiv, 2016. ISSN 1607.06450. doi: 10.1038/nature14236. URL http://arxiv.org/abs/1607.06450.",
            "crossref": "https://dx.doi.org/10.1038/nature14236",
            "arxiv_url": "https://arxiv.org/pdf/1607.06450"
        },
        {
            "id": "5",
            "entry": "[5] Andrea Banino, Caswell Barry, Benigno Uria, Charles Blundell, Timothy Lillicrap, Piotr Mirowski, Alexander Pritzel, Martin J Chadwick, Thomas Degris, Joseph Modayil, Greg Wayne, Hubert Soyer, Fabio Viola, Brian Zhang, Ross Goroshin, Neil Rabinowitz, Razvan Pascanu, Charlie Beattie, Stig Petersen, Amir Sadik, Stephen Gaffney, Helen King, Koray Kavukcuoglu, Demis Hassabis, Raia Hadsell, and Dharshan Kumaran. Vector-based navigation using grid-like representations in artificial agents. Nature, 557(7705): 429–433, may 2018. ISSN 0028-0836. doi: 10.1038/s41586-018-0102-6. URL http://dx.doi.org/10.1038/s41586-018-0102-6http://www.nature.com/articles/s41586-018-0102-6.",
            "crossref": "https://dx.doi.org/10.1038/s41586-018-0102-6",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1038/s41586-018-0102-6"
        },
        {
            "id": "6",
            "entry": "[6] C. Barry, L. L. Ginzberg, J. O’Keefe, and N. Burgess. Grid cell firing patterns signal environmental novelty by expansion. Proceedings of the National Academy of Sciences, 109(43):17687–17692, 2012. ISSN 0027-8424. doi: 10.1073/pnas.1209918109. URL http://www.pnas.org/cgi/doi/10.1073/pnas.1209918109.",
            "crossref": "https://dx.doi.org/10.1073/pnas.1209918109",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1073/pnas.1209918109"
        },
        {
            "id": "7",
            "entry": "[7] E Bostock, R U Muller, and J L Kubie. Experience-dependent modifications of hippocampal place cell firing. Hippocampus, 1(2):193–205, 1991. ISSN 1050-9631. doi: 10.1002/hipo.450010207.",
            "crossref": "https://dx.doi.org/10.1002/hipo.450010207",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1002/hipo.450010207"
        },
        {
            "id": "8",
            "entry": "[8] Cindy A. Buckmaster, Howard Eichenbaum, David G Amaral, Wendy A Suzuki, and Peter R Rapp. Entorhinal Cortex Lesions Disrupt the Relational Organization of Memory in Monkeys. Journal of Neuroscience, 24(44):9811–9825, 2004. ISSN 0270-6474. doi: 10.1523/JNEUROSCI.1532-04.2004. URL http://www.jneurosci.org/cgi/doi/10.1523/JNEUROSCI.1532-04.2004.",
            "crossref": "https://dx.doi.org/10.1523/JNEUROSCI.1532-04.2004",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1523/JNEUROSCI.1532-04.2004"
        },
        {
            "id": "9",
            "entry": "[9] Daniel Bush, Caswell Barry, Daniel Manson, and Neil Burgess. Using Grid Cells for Navigation. Neuron, 87(3):507–520, 2015. ISSN 10974199. doi: 10.1016/j.neuron.2015.07.006. URL http://dx.doi.org/10.1016/j.neuron.2015.07.006.",
            "crossref": "https://dx.doi.org/10.1016/j.neuron.2015.07.006",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1016/j.neuron.2015.07.006"
        },
        {
            "id": "10",
            "entry": "[10] Alexandra O. Constantinescu, Jill X. O’Reilly, and Timothy E. J. Behrens. Organizing conceptual knowledge in humans with a gridlike code. Science, 352(6292):1464–1468, 2016. ISSN 10959203. doi: 10.1126/science.aaf0941.",
            "crossref": "https://dx.doi.org/10.1126/science.aaf0941",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1126/science.aaf0941"
        },
        {
            "id": "11",
            "entry": "[11] Christopher J. Cueva and Xue-Xin Wei. Emergence of grid-like representations by training recurrent neural networks to perform spatial localization. pages 1–19, 2018. URL http://arxiv.org/abs/1803.07770.",
            "url": "http://arxiv.org/abs/1803.07770",
            "arxiv_url": "https://arxiv.org/pdf/1803.07770"
        },
        {
            "id": "12",
            "entry": "[12] Sachin S Deshmukh and James J Knierim. Influence of local objects on hippocampal representations: Landmark vectors and memory. Hippocampus, 23(4):253–67, apr 2013. ISSN 1098-1063. doi: 10.1002/hipo.22101. URL http://www.ncbi.nlm.nih.gov/pubmed/23447419http://www.pubmedcentral.nih.gov/articlerender.fcgi?artid=PMC3869706.",
            "crossref": "https://dx.doi.org/10.1002/hipo.22101",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1002/hipo.22101"
        },
        {
            "id": "13",
            "entry": "[13] Yedidyah Dordek, Daniel Soudry, Ron Meir, and Dori Derdikman. Extracting grid cell characteristics from place cell inputs using non-negative principal component analysis. eLife, 5(MARCH2016):1–36, 2016. ISSN 2050084X. doi: 10.7554/eLife.10094.",
            "crossref": "https://dx.doi.org/10.7554/eLife.10094",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.7554/eLife.10094"
        },
        {
            "id": "14",
            "entry": "[14] J. A. Dusek and H. Eichenbaum. The hippocampus and memory for orderly stimulus relations. Proceedings of the National Academy of Sciences, 94(13):7109–7114, 1997. ISSN 0027-8424. doi: 10.1073/pnas.94.13. 7109. URL http://www.pnas.org/cgi/doi/10.1073/pnas.94.13.7109.",
            "crossref": "https://dx.doi.org/10.1073/pnas.94.13.7109",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1073/pnas.94.13.7109"
        },
        {
            "id": "15",
            "entry": "[15] Marco Fraccaro, Danilo Jimenez Rezende, Yori Zwols, Alexander Pritzel, S. M. Ali Eslami, and Fabio Viola. Generative Temporal Models with Spatial Memory for Partially Observed Environments. (Icml), apr 2018. URL http://arxiv.org/abs/1804.09401.",
            "url": "http://arxiv.org/abs/1804.09401",
            "arxiv_url": "https://arxiv.org/pdf/1804.09401"
        },
        {
            "id": "16",
            "entry": "[16] Marianne Fyhn, Torkel Hafting, Alessandro Treves, May Britt Moser, and Edvard I. Moser. Hippocampal remapping and grid realignment in entorhinal cortex. Nature, 446(7132):190–194, 2007. ISSN 14764687. doi: 10.1038/nature05601.",
            "crossref": "https://dx.doi.org/10.1038/nature05601",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1038/nature05601"
        },
        {
            "id": "17",
            "entry": "[17] Mevlana Gemici, Chia-Chun Hung, Adam Santoro, Greg Wayne, Shakir Mohamed, Danilo J. Rezende, David Amos, and Timothy Lillicrap. Generative Temporal Models with Memory. pages 1–25, 2017. ISSN 1702.04649. URL http://arxiv.org/abs/1702.04649.",
            "url": "http://arxiv.org/abs/1702.04649",
            "arxiv_url": "https://arxiv.org/pdf/1702.04649"
        },
        {
            "id": "18",
            "entry": "[18] Torkel Hafting, Marianne Fyhn, Sturla Molden, May-britt Britt Moser, and Edvard I. Moser. Microstructure of a spatial map in the entorhinal cortex. Nature, 436(7052):801–806, 2005. ISSN 00280836. doi: 10.1038/nature03721.",
            "crossref": "https://dx.doi.org/10.1038/nature03721",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1038/nature03721"
        },
        {
            "id": "19",
            "entry": "[19] Demis Hassabis, Dharshan Kumaran, S. D. Vann, and E. A. Maguire. Patients with hippocampal amnesia cannot imagine new experiences. Proceedings of the National Academy of Sciences, 104(5):1726–1731, 2007. ISSN 0027-8424. doi: 10.1073/pnas.0610561104. URL http://www.pnas.org/cgi/doi/10.1073/pnas.0610561104.",
            "crossref": "https://dx.doi.org/10.1073/pnas.0610561104",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1073/pnas.0610561104"
        },
        {
            "id": "20",
            "entry": "[20] Demis Hassabis, Dharshan Kumaran, Christopher Summerfield, and Matthew Botvinick. NeuroscienceInspired Artificial Intelligence. Neuron, 95(2):245–258, 2017. ISSN 10974199. doi: 10.1016/j.neuron. 2017.06.011. URL http://dx.doi.org/10.1016/j.neuron.2017.06.011.",
            "crossref": "https://dx.doi.org/10.1016/j.neuron.2017.06.011",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1016/j.neuron.2017.06.011"
        },
        {
            "id": "21",
            "entry": "[21] Øyvind Arne Høydal, Emilie Ranheim Skytøen, M B Moser, and Edvard I Moser. Object-vector cells in the medial entorhinal cortex. bioRxiv, 2018. doi: 10.1101/286286.",
            "crossref": "https://dx.doi.org/10.1101/286286",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1101/286286"
        },
        {
            "id": "22",
            "entry": "[22] Diederik P. Kingma and Jimmy Lei Ba. Adam: A Method for Stochastic Optimization. pages 1–15, 2014. ISSN 09252312. doi: http://doi.acm.org.ezproxy.lib.ucf.edu/10.1145/1830483.1830503. URL http://arxiv.org/abs/1412.6980.",
            "url": "http://doi.acm.org.ezproxy.lib.ucf.edu/10.1145/1830483.1830503",
            "arxiv_url": "https://arxiv.org/pdf/1412.6980"
        },
        {
            "id": "23",
            "entry": "[23] Diederik P. Kingma and Max Welling. Auto-Encoding Variational Bayes. (Ml):1–14, 2013. ISSN 1312.6114v10. doi: 10.1051/0004-6361/201527329. URL http://arxiv.org/abs/1312.6114.",
            "crossref": "https://dx.doi.org/10.1051/0004-6361/201527329",
            "arxiv_url": "https://arxiv.org/pdf/1312.6114"
        },
        {
            "id": "24",
            "entry": "[24] Kirsten Brun Kjelstrup, Trygve Solstad, Vegard Heimly Brun, Torkel Hafting, Stefan Leutgeb, Menno P. Witter, Edvard I. Moser, and May-Britt Moser. Finite Scale of Spatial Represenation in the Hippocampus. Science, 321(July):140 – 143, 2008. ISSN 0036-8075.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Kjelstrup%2C%20Kirsten%20Brun%20Solstad%2C%20Trygve%20Brun%2C%20Vegard%20Heimly%20Hafting%2C%20Torkel%20Finite%20Scale%20of%20Spatial%20Represenation%20in%20the%20Hippocampus%202008",
            "oa_query": "https://api.scholarcy.com/oa_version?query=Kjelstrup%2C%20Kirsten%20Brun%20Solstad%2C%20Trygve%20Brun%2C%20Vegard%20Heimly%20Hafting%2C%20Torkel%20Finite%20Scale%20of%20Spatial%20Represenation%20in%20the%20Hippocampus%202008"
        },
        {
            "id": "25",
            "entry": "[25] Robert W. Komorowski, Joseph R. Manns, and Howard Eichenbaum. Robust Conjunctive Item-Place Coding by Hippocampal Neurons Parallels Learning What Happens Where. Journal of Neuroscience, 29(31):9918–9929, 2009. ISSN 0270-6474. doi: 10.1523/JNEUROSCI.1378-09.2009. URL http://www.jneurosci.org/cgi/doi/10.1523/JNEUROSCI.1378-09.2009.",
            "crossref": "https://dx.doi.org/10.1523/JNEUROSCI.1378-09.2009",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1523/JNEUROSCI.1378-09.2009"
        },
        {
            "id": "26",
            "entry": "[26] Alex Krizhevsky, Ilya Sutskever, and Geoffrey E Hinton. ImageNet Classification with Deep Convolutional Neural Networks. Advances In Neural Information Processing Systems, pages 1–9, 2012. ISSN 10495258. doi: http://dx.doi.org/10.1016/j.protcy.2014.09.007.",
            "crossref": "https://dx.doi.org/10.1016/j.protcy.2014.09.007",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1016/j.protcy.2014.09.007"
        },
        {
            "id": "27",
            "entry": "[27] Julia Krupic, Neil Burgess, and John O’Keefe. Neural Representations of Location Composed of Spatially Periodic Bands. 337(August):853–857, 2012. URL http://www.sciencemag.org/content/337/6096/853.full.pdf.",
            "url": "http://www.sciencemag.org/content/337/6096/853.full.pdf"
        },
        {
            "id": "28",
            "entry": "[28] Dharshan Kumaran, Jennifer J. Summerfield, Demis Hassabis, and Eleanor A. Maguire. Tracking the Emergence of Conceptual Knowledge during Human Decision Making. Neuron, 63(6):889–901, 2009. ISSN 08966273. doi: 10.1016/j.neuron.2009.07.030. URL http://dx.doi.org/10.1016/j.neuron.2009.07.030.",
            "crossref": "https://dx.doi.org/10.1016/j.neuron.2009.07.030",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1016/j.neuron.2009.07.030"
        },
        {
            "id": "29",
            "entry": "[29] Stefan Leutgeb, Jill K. Leutgeb, Carol A. Barnes, Edvard I. Moser, Bruce L. McNaughton, and May-Britt Moser. Independent Codes for Spatial and Episodic Memory in Hippocampal Neuronal Ensembles. (July): 619–624, jul 2005.",
            "scholar_url": "https://scholar.google.co.uk/scholar?q=Leutgeb%2C%20Stefan%20Leutgeb%2C%20Jill%20K.%20Barnes%2C%20Carol%20A.%20Moser%2C%20Edvard%20I.%20Independent%20Codes%20for%20Spatial%20and%20Episodic%20Memory%20in%20Hippocampal%20Neuronal%20Ensembles%202005-07"
        },
        {
            "id": "30",
            "entry": "[30] James L. McClelland, Bruce L. McNaughton, and Randall C. O’Reilly. Why there are complementary learning systems in the hippocampus and neocortex: Insights from the successes and failures of connectionist models of learning and memory. Psychological Review, 102(3):419–457, 1995. ISSN 0033295X. doi: 10.1037/0033-295X.102.3.419.",
            "crossref": "https://dx.doi.org/10.1037/0033-295X.102.3.419",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1037/0033-295X.102.3.419"
        },
        {
            "id": "31",
            "entry": "[31] Volodymyr Mnih, Koray Kavukcuoglu, David Silver, Andrei A Rusu, Joel Veness, Bellemare Marc G, Alex Graves, Martin Riedmiller, Andreas K. Fidjeland, Georg Ostrovski, Stig Petersen, Charles Beattie, Amir Sadik, Ioannis Antonoglou, Helen King, Dharshan Kumaran, Daan Wierstra, Shane Legg, and Demis Hassabis. Human-level control through deep reinforcement learning. Nature, 518(7540):529–533, 2015. ISSN 10450823. doi: 10.1038/nature14236. URL http://dx.doi.org/10.1038/nature14236.",
            "crossref": "https://dx.doi.org/10.1038/nature14236",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1038/nature14236"
        },
        {
            "id": "32",
            "entry": "[32] John O’Keefe and J. Dostrovsky. The hippocampus as a spatial map. Preliminary evidence from unit activity in the freely-moving rat. Brain Research, 34(1):171–175, nov 1971. ISSN 00068993. doi: 10.1016/0006-8993(71)90358-1. URL http://linkinghub.elsevier.com/retrieve/pii/0006899371903581.",
            "crossref": "https://dx.doi.org/10.1016/0006-8993(71)90358-1",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1016/0006-8993%2871%2990358-1"
        },
        {
            "id": "33",
            "entry": "[33] Danilo Jimenez Rezende, Shakir Mohamed, and Daan Wierstra. Stochastic Backpropagation and Approximate Inference in Deep Generative Models. 2014. ISSN 10495258. doi: 10.1051/0004-6361/201527329. URL http://arxiv.org/abs/1401.4082.",
            "crossref": "https://dx.doi.org/10.1051/0004-6361/201527329",
            "arxiv_url": "https://arxiv.org/pdf/1401.4082"
        },
        {
            "id": "34",
            "entry": "[34] Trygve Solstad, Charlotte N Boccara, Emilio Kropff, May-Britt Moser, and Edvard I Moser. Representation of geometric borders in the entorhinal cortex. Science (New York, N.Y.), 322(5909):1865–8, dec 2008. ISSN 1095-9203. doi: 10.1126/science.1166466. URL papers3://publication/doi/10.1126/science. 1166466http://www.ncbi.nlm.nih.gov/pubmed/19095945.",
            "crossref": "https://dx.doi.org/10.1126/science.1166466",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1126/science.1166466"
        },
        {
            "id": "35",
            "entry": "[35] Kimberley L. Kimberly L. Stachenfeld, Matthew M. Botvinick, and Samuel J. Gershman. The hippocampus as a predictive map. Nature Neuroscience, 20(11):1643–1653, 2017. ISSN 15461726. doi: 10.1038/nn. 4650.",
            "crossref": "https://dx.doi.org/10.1038/nn.4650",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1038/nn.4650"
        },
        {
            "id": "36",
            "entry": "[36] Martin Stemmler, Alexander Mathis, and Andreas Herz. Connecting Multiple Spatial Scales to Decode the Population Activity of Grid Cells. Science Advances, in press(December):1–12, 2015. ISSN 2375-2548. doi: 10.1126/science.1500816.",
            "crossref": "https://dx.doi.org/10.1126/science.1500816",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1126/science.1500816"
        },
        {
            "id": "37",
            "entry": "[37] Hanne Stensola, Tor Stensola, Trygve Solstad, Kristian FrØland, May-Britt Britt Moser, and Edvard I. Moser. The entorhinal grid map is discretized. Nature, 492(7427):72–78, 2012. ISSN 00280836. doi: 10.1038/nature11649. URL http://www.nature.com/doifinder/10.1038/nature11649http://dx.doi.org/10.1038/nature11649.",
            "crossref": "https://dx.doi.org/10.1038/nature11649",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1038/nature11649"
        },
        {
            "id": "38",
            "entry": "[38] J S Taube, Robert U Muller, and J B Ranck. Head-direction cells recorded from the postsubiculum in freely moving rats. I. Description and quantitative analysis. The Journal of neuroscience : the official journal of the Society for Neuroscience, 10(2):420–35, 1990. ISSN 0270-6474. doi: 10.1212/01.wnl.0000299117. 48935.2e. URL http://www.ncbi.nlm.nih.gov/pubmed/2303851.",
            "crossref": "https://dx.doi.org/10.1212/01.wnl.0000299117.48935.2e",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1212/01.wnl.0000299117.48935.2e"
        },
        {
            "id": "39",
            "entry": "[39] Edward C. Tolman. Cognitive maps in rats and men. Psychological Review, 55(4):189–208, 1948. ISSN 1939-1471. doi: 10.1037/h0061626. URL http://doi.apa.org/getdoi.cfm?doi=10.1037/h0061626.",
            "crossref": "https://dx.doi.org/10.1037/h0061626",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1037/h0061626"
        },
        {
            "id": "40",
            "entry": "[40] Albert Tsao, Jørgen Sugar, Li Lu, Cheng Wang, James J. Knierim, May-Britt Moser, and Edvard I. Moser. Integrating time from experience in the lateral entorhinal cortex. Nature, 2018. ISSN 0028-0836. doi: 10.1038/s41586-018-0459-6. URL http://www.nature.com/articles/s41586-018-0459-6.",
            "crossref": "https://dx.doi.org/10.1038/s41586-018-0459-6",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1038/s41586-018-0459-6"
        },
        {
            "id": "41",
            "entry": "[41] James C. R. Whittington and Rafal Bogacz. An Approximation of the Error Backpropagation Algorithm in a Predictive Coding Network with Local Hebbian Synaptic Plasticity. Neural Computation, 29(5):1229–1262, may 2017. ISSN 0899-7667. doi: 10.1162/NECO_a_00949. URL http://www.mitpressjournals.org/doi/10.1162/NECO{_}a{_}00949https://www.biorxiv.org/content/early/2016/12/23/035451https://www.ncbi.nlm.nih.gov/pubmed/28333583{%}0Ahttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC5467749/pdf/emss-73.",
            "crossref": "https://dx.doi.org/10.1162/NECO_a_00949",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1162/NECO_a_00949"
        },
        {
            "id": "42",
            "entry": "[42] Emma R. Wood, Paul A. Dudchenko, and Howard Eichenbaum. The global record of memory in hippocampal neuronal activity. Nature, 397(6720):613–616, 1999. ISSN 00280836. doi: 10.1038/17605. ",
            "crossref": "https://dx.doi.org/10.1038/17605",
            "oa_query": "https://api.scholarcy.com/oa_version?query=https%3A//dx.doi.org/10.1038/17605"
        }
    ]
}
